TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
/**
  ******************************************************************************
  * @file    stm32l15x_tsl_ct_acquisition.c
  * @author  MCD Application Team
  * @version v0.1.3
  * @date    23-September-2011
  * @brief   STM32 Touch Sensing Library - This file provides all the functions
  *         to manage the Charge-Transfer acquisition based on STM32L15x devices
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l15x_tsl_ct_acquisition.h"
#include "stm32_tsl_services.h"
#include "stm32l1xx_conf.h"

/* This file must be used with STM32L15xx8 (64kb) or STM32L15xxB (128kb) devices only */

#if defined(STM32L15XX8B)

#if defined ( __CC_ARM ) || defined( __GNUC__ ) // KEIL
#define TSL_NOP   __NOP();
#elif defined ( __ICCARM__ ) // IAR
#define TSL_NOP   __ASM("nop\n");
#endif

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Define the 1st Channel mask */
#define SCKEY_P1_MASK (0)

#if (SCKEY_P1_CH == CH1)
#undef SCKEY_P1_MASK
#define SCKEY_P1_MASK (SCKEY_P1_A | SCKEY_P1_B | SCKEY_P1_C | SCKEY_P1_D |\
                       SCKEY_P1_E | SCKEY_P1_F | SCKEY_P1_G | SCKEY_P1_H |\
                       SCKEY_P1_I | SCKEY_P1_J | MKEY_CH1_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P1_CH == CH1)

#if (SCKEY_P1_CH == CH2)
#undef SCKEY_P1_MASK
#define SCKEY_P1_MASK (SCKEY_P1_A | SCKEY_P1_B | SCKEY_P1_C | SCKEY_P1_D |\
                       SCKEY_P1_E | SCKEY_P1_F | SCKEY_P1_G | SCKEY_P1_H |\
                       SCKEY_P1_I | SCKEY_P1_J | MKEY_CH2_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P1_CH == CH2)

#if (SCKEY_P1_CH == CH3)
#undef SCKEY_P1_MASK
#define SCKEY_P1_MASK (SCKEY_P1_A | SCKEY_P1_B | SCKEY_P1_C | SCKEY_P1_D |\
                       SCKEY_P1_E | SCKEY_P1_F | SCKEY_P1_G | SCKEY_P1_H |\
                       SCKEY_P1_I | SCKEY_P1_J | MKEY_CH3_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P1_CH == CH3)

#if (SCKEY_P1_CH == CH4)
#undef SCKEY_P1_MASK
#define SCKEY_P1_MASK (SCKEY_P1_A | SCKEY_P1_B | SCKEY_P1_C | SCKEY_P1_D |\
                       SCKEY_P1_E | SCKEY_P1_F | SCKEY_P1_G | SCKEY_P1_H |\
                       SCKEY_P1_I | SCKEY_P1_J | MKEY_CH4_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P1_CH == CH4)

/* Define the 2nd Channel mask */
#if (NUMBER_OF_ACQUISITION_PORTS > 1)

#define SCKEY_P2_MASK (0)

#if (SCKEY_P2_CH == CH1)
#undef SCKEY_P2_MASK
#define SCKEY_P2_MASK (SCKEY_P2_A | SCKEY_P2_B | SCKEY_P2_C | SCKEY_P2_D |\
                       SCKEY_P2_E | SCKEY_P2_F | SCKEY_P2_G | SCKEY_P2_H |\
                       SCKEY_P2_I | SCKEY_P2_J | MKEY_CH1_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P2_CH == CH1)

#if (SCKEY_P2_CH == CH2)
#undef SCKEY_P2_MASK
#define SCKEY_P2_MASK (SCKEY_P2_A | SCKEY_P2_B | SCKEY_P2_C | SCKEY_P2_D |\
                       SCKEY_P2_E | SCKEY_P2_F | SCKEY_P2_G | SCKEY_P2_H |\
                       SCKEY_P2_I | SCKEY_P2_J | MKEY_CH2_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P2_CH == CH2)

#if (SCKEY_P2_CH == CH3)
#undef SCKEY_P2_MASK
#define SCKEY_P2_MASK (SCKEY_P2_A | SCKEY_P2_B | SCKEY_P2_C | SCKEY_P2_D |\
                       SCKEY_P2_E | SCKEY_P2_F | SCKEY_P2_G | SCKEY_P2_H |\
                       SCKEY_P2_I | SCKEY_P2_J | MKEY_CH3_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P2_CH == CH3)

#if (SCKEY_P2_CH == CH4)
#undef SCKEY_P2_MASK
#define SCKEY_P2_MASK (SCKEY_P2_A | SCKEY_P2_B | SCKEY_P2_C | SCKEY_P2_D |\
                       SCKEY_P2_E | SCKEY_P2_F | SCKEY_P2_G | SCKEY_P2_H |\
                       SCKEY_P2_I | SCKEY_P2_J | MKEY_CH4_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P2_CH == CH4)

#endif
//# (NUMBER_OF_ACQUISITION_PORTS > 1)

/* Define the 3rd Channel mask */
#if (NUMBER_OF_ACQUISITION_PORTS > 2)

#define SCKEY_P3_MASK (0)

#if (SCKEY_P3_CH == CH1)
#undef SCKEY_P3_MASK
#define SCKEY_P3_MASK (SCKEY_P3_A | SCKEY_P3_B | SCKEY_P3_C | SCKEY_P3_D |\
                       SCKEY_P3_E | SCKEY_P3_F | SCKEY_P3_G | SCKEY_P3_H |\
                       SCKEY_P3_I | SCKEY_P3_J | MKEY_CH1_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P2_CH == CH1)

#if (SCKEY_P3_CH == CH2)
#undef SCKEY_P3_MASK
#define SCKEY_P3_MASK (SCKEY_P3_A | SCKEY_P3_B | SCKEY_P3_C | SCKEY_P3_D |\
                       SCKEY_P3_E | SCKEY_P3_F | SCKEY_P3_G | SCKEY_P3_H |\
                       SCKEY_P3_I | SCKEY_P3_J | MKEY_CH2_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P2_CH == CH2)

#if (SCKEY_P3_CH == CH3)
#undef SCKEY_P3_MASK
#define SCKEY_P3_MASK (SCKEY_P3_A | SCKEY_P3_B | SCKEY_P3_C | SCKEY_P3_D |\
                       SCKEY_P3_E | SCKEY_P3_F | SCKEY_P3_G | SCKEY_P3_H |\
                       SCKEY_P3_I | SCKEY_P3_J | MKEY_CH3_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P2_CH == CH3)

#if (SCKEY_P3_CH == CH4)
#undef SCKEY_P3_MASK
#define SCKEY_P3_MASK (SCKEY_P3_A | SCKEY_P3_B | SCKEY_P3_C | SCKEY_P3_D |\
                       SCKEY_P3_E | SCKEY_P3_F | SCKEY_P3_G | SCKEY_P3_H |\
                       SCKEY_P3_I | SCKEY_P3_J | MKEY_CH4_MASK |\
                       ACTIVE_SHIELD_GROUP)
#endif
//# (SCKEY_P2_CH == CH4)

#endif
//# (NUMBER_OF_ACQUISITION_PORTS > 2)

/* Define all channels mask */
#define SCKEY_MASK (SCKEY_P1_MASK | SCKEY_P2_MASK | SCKEY_P3_MASK)
#define SCKEY_MASK_G1 (SCKEY_MASK & GROUP1)
#define SCKEY_MASK_G2 (SCKEY_MASK & GROUP2)
#define SCKEY_MASK_G3 (SCKEY_MASK & GROUP3)
#define SCKEY_MASK_G4 (SCKEY_MASK & GROUP4)
#define SCKEY_MASK_G5 (SCKEY_MASK & GROUP5)
#define SCKEY_MASK_G6 (SCKEY_MASK & GROUP6)
#define SCKEY_MASK_G7 (SCKEY_MASK & GROUP7)
#define SCKEY_MASK_G8 (SCKEY_MASK & GROUP8)
#define SCKEY_MASK_G9 (SCKEY_MASK & GROUP9)
#define SCKEY_MASK_G10 (SCKEY_MASK & GROUP10)

