TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
/* Initialize the SAMPLING capacitor COMP1 masks & COMP2 masks */
#if !defined(PORT_A)
#define SAMP_CAP_COMP1_MASK_A ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MASK_A ((uint32_t)0x00000000)
#endif
//# !defined(PORT_A)

#if !defined(PORT_B)
#define SAMP_CAP_COMP1_MASK_B ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MASK_B ((uint32_t)0x00000000)
#endif
//# !defined(PORT_B)

#if !defined(PORT_C)
#define SAMP_CAP_COMP1_MASK_C ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MASK_C ((uint32_t)0x00000000)
#endif
//# !defined(PORT_C)

/* Define the SAMPLING capacitor comparator channel mask */
#if (SAMP_CAP_CH == CH1)

#ifdef PORT_A
#define SAMP_CAP_PORT_A     (GPIOA)
#define SAMP_CAP_IO_MASK_1  ((uint32_t)0x00000001)   /* PA0 */
#define SAMP_CAP_IO_MASK_2  ((uint32_t)0x00000040)   /* PA6 */
#define SAMP_CAP_IO_MASK_4  ((uint32_t)0x00000100)   /* PA8 */
#define SAMP_CAP_IO_MASK_5  ((uint32_t)0x00002000)   /* PA13 */
#ifdef COMP1
#if(SCKEY_MASK_G1==GROUP1)&&(SCKEY_MASK_G2==GROUP2)
#define SAMP_CAP_COMP1_MASK_A     ((uint32_t)0x00000041)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000041)  /* PA0 and PA6 */
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x00003003)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00001001)
#elif(SCKEY_MASK_G1==GROUP1)&&(SCKEY_MASK_G2==0)
#define SAMP_CAP_COMP1_MASK_A     ((uint32_t)0x00000001)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000001)  /* PA0 */
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x00000003)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00000001)
#elif (SCKEY_MASK_G1==0)&&(SCKEY_MASK_G2==GROUP2)
#define SAMP_CAP_COMP1_MASK_A     ((uint32_t)0x00000040)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000040)  /* PA6 */
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x00003000)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00001000)
#else
#define SAMP_CAP_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#ifdef COMP2
#if(SCKEY_MASK_G4==GROUP4)&&(SCKEY_MASK_G5==GROUP5)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000240)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00002100) /* PA8 and PA13 */
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x0C030000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x04010000)
#elif (SCKEY_MASK_G4==GROUP4)&&(SCKEY_MASK_G5==0)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000200)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00000100) /* PA8 */
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x00030000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x00010000)
#elif (SCKEY_MASK_G4==0)&&(SCKEY_MASK_G5==GROUP5)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000040)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00002000) /* PA13 */
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x0C000000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x04000000)
#else
#define SAMP_CAP_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#define SAMP_CAP_IO_MASK_A         ((SAMP_CAP_COMP1_IO_MASK_A)|(SAMP_CAP_COMP2_IO_MASK_A))
#define SAMP_CAP_MODER_MASK_A      ((SAMP_CAP_COMP1_MODER_MASK_A)|(SAMP_CAP_COMP2_MODER_MASK_A))
#define SAMP_CAP_MODER_MASK_A_OUT  ((SAMP_CAP_COMP1_MODER_MASK_A_OUT)|(SAMP_CAP_COMP2_MODER_MASK_A_OUT))
#endif
//# PORT_A

#ifdef PORT_B
#define SAMP_CAP_PORT_B     (GPIOB)
#define SAMP_CAP_IO_MASK_3  ((uint32_t)0x00000001)   /* PB0 */
#define SAMP_CAP_IO_MASK_6  ((uint32_t)0x00000010)   /* PB4 */
#define SAMP_CAP_IO_MASK_7  ((uint32_t)0x00001000)   /* PB12 */
#ifdef COMP1
#if (SCKEY_MASK_G3==GROUP3)&&(SCKEY_MASK_G7==GROUP7)
#define SAMP_CAP_COMP1_MASK_B     ((uint32_t)0x00040100)
#define SAMP_CAP_COMP1_IO_MASK_B        ((uint32_t)0x00001001)  /* PB0 and PB12 */
#define SAMP_CAP_COMP1_MODER_MASK_B     ((uint32_t)0x03000003)
#define SAMP_CAP_COMP1_MODER_MASK_B_OUT ((uint32_t)0x01000001)
#elif (SCKEY_MASK_G3==GROUP3)&&(SCKEY_MASK_G7==0)
#define SAMP_CAP_COMP1_MASK_B     ((uint32_t)0x00000100)
#define SAMP_CAP_COMP1_IO_MASK_B        ((uint32_t)0x00000001)  /* PB0 */
#define SAMP_CAP_COMP1_MODER_MASK_B     ((uint32_t)0x00000003)
#define SAMP_CAP_COMP1_MODER_MASK_B_OUT ((uint32_t)0x00000001)
#elif (SCKEY_MASK_G3==0)&&(SCKEY_MASK_G7==GROUP7)
#define SAMP_CAP_COMP1_MASK_B     ((uint32_t)0x00040000)
#define SAMP_CAP_COMP1_IO_MASK_B        ((uint32_t)0x00001000)  /* PB12 */
#define SAMP_CAP_COMP1_MODER_MASK_B     ((uint32_t)0x03000000)
#define SAMP_CAP_COMP1_MODER_MASK_B_OUT ((uint32_t)0x01000000)
#else
#define SAMP_CAP_COMP1_MASK_B           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_B        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_B_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP1_MASK_B           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_B        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_B_OUT ((uint32_t)0x00000000)
#endif
#ifdef COMP2
#if (SCKEY_MASK_G6==GROUP6)
#define SAMP_CAP_COMP2_MASK_B     ((uint32_t)0x00000010)
#define SAMP_CAP_COMP2_IO_MASK_B        ((uint32_t)0x00000010) /* PB4 */
#define SAMP_CAP_COMP2_MODER_MASK_B     ((uint32_t)0x00000300)
#define SAMP_CAP_COMP2_MODER_MASK_B_OUT ((uint32_t)0x00000100)
#else
#define SAMP_CAP_COMP2_MASK_B           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_B        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_B_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP2_MASK_B           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_B        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_B_OUT ((uint32_t)0x00000000)
#endif
#define SAMP_CAP_IO_MASK_B         ((SAMP_CAP_COMP1_IO_MASK_B)|(SAMP_CAP_COMP2_IO_MASK_B))
#define SAMP_CAP_MODER_MASK_B      ((SAMP_CAP_COMP1_MODER_MASK_B)|(SAMP_CAP_COMP2_MODER_MASK_B))
#define SAMP_CAP_MODER_MASK_B_OUT  ((SAMP_CAP_COMP1_MODER_MASK_B_OUT)|(SAMP_CAP_COMP2_MODER_MASK_B_OUT))
#endif
//# PORT_B

#ifdef PORT_C
#define SAMP_CAP_PORT_C     (GPIOC)
#define SAMP_CAP_IO_MASK_8  ((uint32_t)0x00000001)   /* PC0 */
#define SAMP_CAP_IO_MASK_9  ((uint32_t)0x00000010)  /* PC4 */
#define SAMP_CAP_IO_MASK_10 ((uint32_t)0x00000040) /* PC6 */
#ifdef COMP1
#if (SCKEY_MASK_G8==GROUP8)&&(SCKEY_MASK_G9==GROUP9)
#define SAMP_CAP_COMP1_MASK_C     ((uint32_t)0x00004400)
#define SAMP_CAP_COMP1_IO_MASK_C        ((uint32_t)0x00000011)  /* PC0 and PC4 */
#define SAMP_CAP_COMP1_MODER_MASK_C     ((uint32_t)0x00000303)
#define SAMP_CAP_COMP1_MODER_MASK_C_OUT ((uint32_t)0x00000101)
#elif (SCKEY_MASK_G8==GROUP8)&&(SCKEY_MASK_G9==0)
#define SAMP_CAP_COMP1_MASK_C     ((uint32_t)0x00004000)
#define SAMP_CAP_COMP1_IO_MASK_C        ((uint32_t)0x00000001)  /* PC0 */
#define SAMP_CAP_COMP1_MODER_MASK_C     ((uint32_t)0x00000003)
#define SAMP_CAP_COMP1_MODER_MASK_C_OUT ((uint32_t)0x00000001)
#elif (SCKEY_MASK_G8==0)&&(SCKEY_MASK_G9==GROUP9)
#define SAMP_CAP_COMP1_MASK_C     ((uint32_t)0x00004000)
#define SAMP_CAP_COMP1_IO_MASK_C        ((uint32_t)0x00000010)  /* PC4 */
#define SAMP_CAP_COMP1_MODER_MASK_C     ((uint32_t)0x00000300)
#define SAMP_CAP_COMP1_MODER_MASK_C_OUT ((uint32_t)0x00000100)
#else
#define SAMP_CAP_COMP1_MASK_C           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_C        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_C     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_C_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP1_MASK_C           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_C        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_C     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_C_OUT ((uint32_t)0x00000000)
#endif
#ifdef COMP2
#if (SCKEY_MASK_G10==GROUP10)
#define SAMP_CAP_COMP2_MASK_C     ((uint32_t)0x00000001)
#define SAMP_CAP_COMP2_IO_MASK_C        ((uint32_t)0x00000040) /* PC6 */
#define SAMP_CAP_COMP2_MODER_MASK_C     ((uint32_t)0x00003000)
#define SAMP_CAP_COMP2_MODER_MASK_C_OUT ((uint32_t)0x00001000)
#else
#define SAMP_CAP_COMP2_MASK_C           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_C        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_C     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_C_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP2_MASK_C           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_C        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_C     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_C_OUT ((uint32_t)0x00000000)
#endif
#define SAMP_CAP_IO_MASK_C         ((SAMP_CAP_COMP1_IO_MASK_C)|(SAMP_CAP_COMP2_IO_MASK_C))
#define SAMP_CAP_MODER_MASK_C      ((SAMP_CAP_COMP1_MODER_MASK_C)|(SAMP_CAP_COMP2_MODER_MASK_C))
#define SAMP_CAP_MODER_MASK_C_OUT  ((SAMP_CAP_COMP1_MODER_MASK_C_OUT)|(SAMP_CAP_COMP2_MODER_MASK_C_OUT))
#endif
//# PORT_C

#endif
//# (SAMP_CAP_CH == CH1)

#if (SAMP_CAP_CH == CH2)

#ifdef PORT_A
#define SAMP_CAP_PORT_A     (GPIOA)
#define SAMP_CAP_IO_MASK_1  ((uint32_t)0x00000002)   /* PA1 */
#define SAMP_CAP_IO_MASK_2  ((uint32_t)0x00000080)   /* PA7 */
#define SAMP_CAP_IO_MASK_4  ((uint32_t)0x00000200)   /* PA9 */
#define SAMP_CAP_IO_MASK_5  ((uint32_t)0x00004000)   /* PA14 */
#ifdef COMP1
#if (SCKEY_MASK_G1==GROUP1)&&(SCKEY_MASK_G2==GROUP2)
#define SAMP_CAP_COMP1_MASK_A     ((uint32_t)0x00000082)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000082)  /*PA1 and PA7*/
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x0000C00C)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00004004)
#elif (SCKEY_MASK_G1==GROUP1)&&(SCKEY_MASK_G2==0)
#define SAMP_CAP_COMP1_MASK_A     ((uint32_t)0x00000002)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000002)  /* PA1 */
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x0000000C)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00000004)
#elif (SCKEY_MASK_G1==0)&&(SCKEY_MASK_G2==GROUP2)
#define SAMP_CAP_COMP1_MASK_A     ((uint32_t)0x00000080)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000080)  /* PA7 */
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x0000C000)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00004000)
#else
#define SAMP_CAP_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#ifdef COMP2
#if (SCKEY_MASK_G4==GROUP4)&&(SCKEY_MASK_G5==GROUP5)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000480)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00004200) /* PA9 and PA14 */
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x300C0000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x10040000)
#elif (SCKEY_MASK_G4==GROUP4)&&(SCKEY_MASK_G5==0)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000080)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00000200) /* PA9 */
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x000C0000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x00040000)
#elif (SCKEY_MASK_G4==0)&&(SCKEY_MASK_G2==GROUP5)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000080)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00004200) /* PA14 */
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x30000000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x10000000)
#else
#define SAMP_CAP_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#define SAMP_CAP_IO_MASK_A         ((SAMP_CAP_COMP1_IO_MASK_A)|(SAMP_CAP_COMP2_IO_MASK_A))
#define SAMP_CAP_MODER_MASK_A      ((SAMP_CAP_COMP1_MODER_MASK_A)|(SAMP_CAP_COMP2_MODER_MASK_A))
#define SAMP_CAP_MODER_MASK_A_OUT  ((SAMP_CAP_COMP1_MODER_MASK_A_OUT)|(SAMP_CAP_COMP2_MODER_MASK_A_OUT))
#endif
//# PORT_A

#ifdef PORT_B
#define SAMP_CAP_PORT_B     (GPIOB)
#define SAMP_CAP_IO_MASK_3  ((uint32_t)0x00000002)   /* PB1 */
#define SAMP_CAP_IO_MASK_7  ((uint32_t)0x00002000)   /* PB13 */
#define SAMP_CAP_IO_MASK_6  ((uint32_t)0x00000020)   /* PB5 */
#ifdef COMP1
#if (SCKEY_MASK_G3==GROUP3)&&(SCKEY_MASK_G7==GROUP7)
#define SAMP_CAP_COMP1_MASK_B     ((uint32_t)0x00080200)
#define SAMP_CAP_COMP1_IO_MASK_B        ((uint32_t)0x00002002)  /* PB1 and PB13 */
#define SAMP_CAP_COMP1_MODER_MASK_B     ((uint32_t)0x0C00000C)
#define SAMP_CAP_COMP1_MODER_MASK_B_OUT ((uint32_t)0x04000004)
#elif (SCKEY_MASK_G3==GROUP3)&&(SCKEY_MASK_G7==0)
#define SAMP_CAP_COMP1_MASK_B     ((uint32_t)0x00000200)
#define SAMP_CAP_COMP1_IO_MASK_B        ((uint32_t)0x00000002)  /* PB1 */
#define SAMP_CAP_COMP1_MODER_MASK_B     ((uint32_t)0x0000000C)
#define SAMP_CAP_COMP1_MODER_MASK_B_OUT ((uint32_t)0x00000004)
#elif (SCKEY_MASK_G3==0)&&(SCKEY_MASK_G7==GROUP7)
#define SAMP_CAP_COMP1_MASK_B     ((uint32_t)0x00080000)
#define SAMP_CAP_COMP1_IO_MASK_B        ((uint32_t)0x00002000)  /* PB13 */
#define SAMP_CAP_COMP1_MODER_MASK_B     ((uint32_t)0x0C000000)
#define SAMP_CAP_COMP1_MODER_MASK_B_OUT ((uint32_t)0x04000000)
#else
#define SAMP_CAP_COMP1_MASK_B           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_B        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_B_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP1_MASK_B           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_B        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_B_OUT ((uint32_t)0x00000000)
#endif
#ifdef COMP2
#define SAMP_CAP_COMP2_MASK_B     ((uint32_t)0x00000020)
#define SAMP_CAP_COMP2_IO_MASK_B        ((uint32_t)0x00000020) /* PB5 */
#define SAMP_CAP_COMP2_MODER_MASK_B     ((uint32_t)0x00000C00)
#define SAMP_CAP_COMP2_MODER_MASK_B_OUT ((uint32_t)0x00000400)
#else
#define SAMP_CAP_COMP2_MASK_B           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_B        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_B_OUT ((uint32_t)0x00000000)
#endif
#define SAMP_CAP_IO_MASK_B         ((SAMP_CAP_COMP1_IO_MASK_B)|(SAMP_CAP_COMP2_IO_MASK_B))
#define SAMP_CAP_MODER_MASK_B      ((SAMP_CAP_COMP1_MODER_MASK_B)|(SAMP_CAP_COMP2_MODER_MASK_B))
#define SAMP_CAP_MODER_MASK_B_OUT  ((SAMP_CAP_COMP1_MODER_MASK_B_OUT)|(SAMP_CAP_COMP2_MODER_MASK_B_OUT))
#endif
//# PORT_B

#ifdef PORT_C
#define SAMP_CAP_PORT_C     (GPIOC)
#define SAMP_CAP_IO_MASK_8  ((uint32_t)0x00000002)   /* PC1 */
#define SAMP_CAP_IO_MASK_9  ((uint32_t)0x00000020)  /* PC5 */
#define SAMP_CAP_IO_MASK_10 ((uint32_t)0x00000080) /* PC7 */

