TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
#ifdef COMP1
#if (SCKEY_MASK_G8==GROUP8)&&(SCKEY_MASK_G9==GROUP9)
#define SAMP_CAP_COMP1_MASK_C     ((uint32_t)0x00008800)
#define SAMP_CAP_COMP1_IO_MASK_C        ((uint32_t)0x00000022)  /* PC1 and PC5 */
#define SAMP_CAP_COMP1_MODER_MASK_C     ((uint32_t)0x00000C0C)
#define SAMP_CAP_COMP1_MODER_MASK_C_OUT ((uint32_t)0x00000404)
#elif (SCKEY_MASK_G8==GROUP8)&&(SCKEY_MASK_G9==0)
#define SAMP_CAP_COMP1_MASK_C     ((uint32_t)0x00000800)
#define SAMP_CAP_COMP1_IO_MASK_C        ((uint32_t)0x00000002)  /* PC1 */
#define SAMP_CAP_COMP1_MODER_MASK_C     ((uint32_t)0x0000000C)
#define SAMP_CAP_COMP1_MODER_MASK_C_OUT ((uint32_t)0x00000004)
#elif (SCKEY_MASK_G8==0)&&(SCKEY_MASK_G9==GROUP9)
#define SAMP_CAP_COMP1_MASK_C     ((uint32_t)0x00008000)
#define SAMP_CAP_COMP1_IO_MASK_C        ((uint32_t)0x00000020)  /* PC5 */
#define SAMP_CAP_COMP1_MODER_MASK_C     ((uint32_t)0x00000C00)
#define SAMP_CAP_COMP1_MODER_MASK_C_OUT ((uint32_t)0x00000400)
#else
#define SAMP_CAP_COMP1_MASK_C           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_C        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_C     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_C_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP1_MASK_C           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_C        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_C     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_C_OUT ((uint32_t)0x00000000)
#endif
#ifdef COMP2
#define SAMP_CAP_COMP2_MASK_C     ((uint32_t)0x00000002)
#define SAMP_CAP_COMP2_IO_MASK_C        ((uint32_t)0x00000080) /* PC7 */
#define SAMP_CAP_COMP2_MODER_MASK_C     ((uint32_t)0x0000C000)
#define SAMP_CAP_COMP2_MODER_MASK_C_OUT ((uint32_t)0x00004000)
#else
#define SAMP_CAP_COMP2_MASK_C           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_C        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_C     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_C_OUT ((uint32_t)0x00000000)
#endif
#define SAMP_CAP_IO_MASK_C         ((SAMP_CAP_COMP1_IO_MASK_C)|(SAMP_CAP_COMP2_IO_MASK_C))
#define SAMP_CAP_MODER_MASK_C      ((SAMP_CAP_COMP1_MODER_MASK_C)|(SAMP_CAP_COMP2_MODER_MASK_C))
#define SAMP_CAP_MODER_MASK_C_OUT  ((SAMP_CAP_COMP1_MODER_MASK_C_OUT)|(SAMP_CAP_COMP2_MODER_MASK_C_OUT))
#endif
//# PORT_C

#endif
//# (SAMP_CAP_CH == CH2)

#if (SAMP_CAP_CH == CH3)

#ifdef PORT_A
#define SAMP_CAP_PORT_A     (GPIOA)
#define SAMP_CAP_IO_MASK_1  ((uint32_t)0x00000004)   /* PA2 */
#define SAMP_CAP_IO_MASK_4  ((uint32_t)0x00000400)   /* PA10 */
#define SAMP_CAP_IO_MASK_5  ((uint32_t)0x00008000)   /* PA15 */
#ifdef COMP1
#define SAMP_CAP_COMP1_MASK_A     ((uint32_t)0x00000004)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000004)  /* PA2 */
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x00000030)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00000010)
#else
#define SAMP_CAP_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP1_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#ifdef COMP2
#if (SCKEY_MASK_G4==GROUP4)&&(SCKEY_MASK_G5==GROUP5)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000900)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00008400) /* PA10 and PA15 */
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0xC0300000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x40100000)
#elif (SCKEY_MASK_G4==GROUP4)&&(SCKEY_MASK_G5==0)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000800)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00000400) /* PA10 */
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x00300000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x00100000)
#elif (SCKEY_MASK_G4==0)&&(SCKEY_MASK_G5==GROUP5)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000100)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00008000) /* PA15 */
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0xC0000000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x40000000)
#else
#define SAMP_CAP_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#else
#define SAMP_CAP_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_COMP2_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#endif
#define SAMP_CAP_IO_MASK_A         ((SAMP_CAP_COMP1_IO_MASK_A)|(SAMP_CAP_COMP2_IO_MASK_A))
#define SAMP_CAP_MODER_MASK_A      ((SAMP_CAP_COMP1_MODER_MASK_A)|(SAMP_CAP_COMP2_MODER_MASK_A))
#define SAMP_CAP_MODER_MASK_A_OUT  ((SAMP_CAP_COMP1_MODER_MASK_A_OUT)|(SAMP_CAP_COMP2_MODER_MASK_A_OUT))
#endif
//# PORT_A

#ifdef PORT_B
#define SAMP_CAP_PORT_B     (GPIOB)
#define SAMP_CAP_IO_MASK_7  ((uint32_t)0x00004000)   /* PB14 */
/* Both comparators are used */
#if defined (COMP1) && defined (COMP2)
#define SAMP_CAP_COMP1_MASK_B     ((uint32_t)0x00100000)
#define SAMP_CAP_COMP2_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_IO_MASK_B        ((uint32_t)0x00004000)  /* PB14 */
#define SAMP_CAP_MODER_MASK_B     ((uint32_t)0x30000000)
#define SAMP_CAP_MODER_MASK_B_OUT ((uint32_t)0x10000000)
/* Only the comparator 1 is used */
#elif defined (COMP1)
#define SAMP_CAP_COMP1_MASK_B     ((uint32_t)0x00100000)
#define SAMP_CAP_IO_MASK_B        ((uint32_t)0x00004000)  /* PB14 */
#define SAMP_CAP_MODER_MASK_B     ((uint32_t)0x30000000)
#define SAMP_CAP_MODER_MASK_B_OUT ((uint32_t)0x10000000)
/* Only the comparator 2 is used */
#elif defined (COMP2)
#define SAMP_CAP_COMP2_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_IO_MASK_B        ((uint32_t)0x00000000)
#define SAMP_CAP_MODER_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_MODER_MASK_B_OUT ((uint32_t)0x00000000)
#else
#error "COMPARATOR definition wrong"
#endif
#endif
//# PORT_B

#ifdef PORT_C
#define SAMP_CAP_PORT_C     (GPIOC)
#define SAMP_CAP_IO_MASK_8  ((uint32_t)0x00000004)   /* PC2 */
#define SAMP_CAP_IO_MASK_10 ((uint32_t)0x00000100) /* PC8 */
/* Both comparators are used */
#if defined (COMP1) && defined (COMP2)
#define SAMP_CAP_COMP1_MASK_C     ((uint32_t)0x00001000)
#define SAMP_CAP_COMP2_MASK_C     ((uint32_t)0x00000004)
#define SAMP_CAP_IO_MASK_C        ((uint32_t)0x00000104)  /* PC2, PC8 */
#define SAMP_CAP_MODER_MASK_C     ((uint32_t)0x00030030)
#define SAMP_CAP_MODER_MASK_C_OUT ((uint32_t)0x00010010)
/* Only the comparator 1 is used */
#elif defined (COMP1)
#define SAMP_CAP_COMP1_MASK_C     ((uint32_t)0x00001000)
#define SAMP_CAP_IO_MASK_C        ((uint32_t)0x00000004)  /* PC2 */
#define SAMP_CAP_MODER_MASK_C     ((uint32_t)0x00000030)
#define SAMP_CAP_MODER_MASK_C_OUT ((uint32_t)0x00000010)
/* Only the comparator 2 is used */
#elif defined (COMP2)
#define SAMP_CAP_COMP2_MASK_C     ((uint32_t)0x00000004)
#define SAMP_CAP_IO_MASK_C        ((uint32_t)0x00000100) /* PC8 */
#define SAMP_CAP_MODER_MASK_C     ((uint32_t)0x00030000)
#define SAMP_CAP_MODER_MASK_C_OUT ((uint32_t)0x00010000)
#else
#error "COMPARATOR definition wrong"
#endif
#endif
//# PORT_C

#endif
//# (SAMP_CAP_CH == CH3)

#if (SAMP_CAP_CH == CH4)

#ifdef PORT_A
#define SAMP_CAP_PORT_A     (GPIOA)
#define SAMP_CAP_IO_MASK_1  ((uint32_t)0x00000008)   /* PA3 */
/* Both comparators are used */
#if defined (COMP1) && defined (COMP2)
#define SAMP_CAP_COMP1_MASK_A     ((uint32_t)0x00000008)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_IO_MASK_A        ((uint32_t)0x00000008)  /* PA3*/
#define SAMP_CAP_MODER_MASK_A     ((uint32_t)0x000000C0)
#define SAMP_CAP_MODER_MASK_A_OUT ((uint32_t)0x00000040)
/* Only the comparator 1 is used */
#elif defined (COMP1)
#define SAMP_CAP_COMP1_MASK_A     ((uint32_t)0x00000008)
#define SAMP_CAP_IO_MASK_A        ((uint32_t)0x00000008)  /* PA3 */
#define SAMP_CAP_MODER_MASK_A     ((uint32_t)0x000000C0)
#define SAMP_CAP_MODER_MASK_A_OUT ((uint32_t)0x00000040)
/* Only the comparator 2 is used*/
#elif defined (COMP2)
#define SAMP_CAP_COMP2_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_IO_MASK_A        ((uint32_t)0x00000000)
#define SAMP_CAP_MODER_MASK_A     ((uint32_t)0x00000000)
#define SAMP_CAP_MODER_MASK_A_OUT ((uint32_t)0x00000000)
#else
#error "COMPARATOR definition wrong"
#endif
#endif
//# PORT_A

#ifdef PORT_B
#define SAMP_CAP_PORT_B     (GPIOB)
#define SAMP_CAP_IO_MASK_7  ((uint32_t)0x00200000)   /* PB15 */
/* Both comparators are used */
#if defined (COMP1) && defined (COMP2)
#define SAMP_CAP_COMP1_MASK_B     ((uint32_t)0x00200000)
#define SAMP_CAP_COMP2_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_IO_MASK_B        ((uint32_t)0x00008000)  /* PB15 */
#define SAMP_CAP_MODER_MASK_B     ((uint32_t)0xC0000000)
#define SAMP_CAP_MODER_MASK_B_OUT ((uint32_t)0x40000000)
/* Only the comparator 1 is used */
#elif defined (COMP1)
#define SAMP_CAP_COMP1_MASK_B     ((uint32_t)0x00200000)
#define SAMP_CAP_IO_MASK_B        ((uint32_t)0x00008000)  /* PB15 */
#define SAMP_CAP_MODER_MASK_B     ((uint32_t)0xC0000000)
#define SAMP_CAP_MODER_MASK_B_OUT ((uint32_t)0x40000000)
/* Only the comparator 2 is used */
#elif defined (COMP2)
#define SAMP_CAP_COMP2_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_IO_MASK_B        ((uint32_t)0x00000000)
#define SAMP_CAP_MODER_MASK_B     ((uint32_t)0x00000000)
#define SAMP_CAP_MODER_MASK_B_OUT ((uint32_t)0x00000000)
#else
#error "COMPARATOR definition wrong"
#endif
#endif
//# PORT_B

#ifdef PORT_C
#define SAMP_CAP_PORT_C     (GPIOC)
#define SAMP_CAP_IO_MASK_8  ((uint32_t)0x00000008)   /* PC3 */
#define SAMP_CAP_IO_MASK_10 ((uint32_t)0x00000200) /* PC9 */
/* Both comparators are used */
#if defined (COMP1) && defined (COMP2)
#define SAMP_CAP_COMP1_MASK_C     ((uint32_t)0x00002000)
#define SAMP_CAP_COMP2_MASK_C     ((uint32_t)0x00000008)
#define SAMP_CAP_IO_MASK_C        ((uint32_t)0x00000208)  /* PC3, PC9 */
#define SAMP_CAP_MODER_MASK_C     ((uint32_t)0x000C00C0)
#define SAMP_CAP_MODER_MASK_C_OUT ((uint32_t)0x00040040)
/* Only the comparator 1 is used */
#elif defined (COMP1)
#define SAMP_CAP_COMP1_MASK_C     ((uint32_t)0x00002000)
#define SAMP_CAP_IO_MASK_C        ((uint32_t)0x00000008)  /* PC3 */
#define SAMP_CAP_MODER_MASK_C     ((uint32_t)0x000000C0)
#define SAMP_CAP_MODER_MASK_C_OUT ((uint32_t)0x00000040)
/* Only the comparator 2 is used */
#elif defined (COMP2)
#define SAMP_CAP_COMP2_MASK_C     ((uint32_t)0x00000008)
#define SAMP_CAP_IO_MASK_C        ((uint32_t)0x00000200) /* PC9 */
#define SAMP_CAP_MODER_MASK_C     ((uint32_t)0x000C0000)
#define SAMP_CAP_MODER_MASK_C_OUT ((uint32_t)0x00040000)
#else
#error "COMPARATOR definition wrong"
#endif
#endif
//# PORT_C

#endif
//# (SAMP_CAP_CH == CH4)

#define SAMP_CAP_COMP1_MASK (uint32_t)(SAMP_CAP_COMP1_MASK_A | SAMP_CAP_COMP1_MASK_B | SAMP_CAP_COMP1_MASK_C)
#define SAMP_CAP_COMP2_MASK (uint32_t)(SAMP_CAP_COMP2_MASK_A | SAMP_CAP_COMP2_MASK_B | SAMP_CAP_COMP2_MASK_C)

#if (ACTIVE_SHIELD_CHANNEL > 0)

/* RE-Define the 1st Channel mask without ACTIVE_SHIELD_GROUP */

#if (SCKEY_P1_CH == CH1)
#undef SCKEY_P1_MASK
#define SCKEY_P1_MASK (SCKEY_P1_A | SCKEY_P1_B | SCKEY_P1_C | SCKEY_P1_D |\
                       SCKEY_P1_E | SCKEY_P1_F | SCKEY_P1_G | SCKEY_P1_H |\
                       SCKEY_P1_I | SCKEY_P1_J | MKEY_CH1_MASK)
#endif
//# (SCKEY_P1_CH == CH1)

#if (SCKEY_P1_CH == CH2)
#undef SCKEY_P1_MASK
#define SCKEY_P1_MASK (SCKEY_P1_A | SCKEY_P1_B | SCKEY_P1_C | SCKEY_P1_D |\
                       SCKEY_P1_E | SCKEY_P1_F | SCKEY_P1_G | SCKEY_P1_H |\
                       SCKEY_P1_I | SCKEY_P1_J | MKEY_CH2_MASK)
#endif
//# (SCKEY_P1_CH == CH2)

