TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
#if (SCKEY_P1_CH == CH3)
#undef SCKEY_P1_MASK
#define SCKEY_P1_MASK (SCKEY_P1_A | SCKEY_P1_B | SCKEY_P1_C | SCKEY_P1_D |\
                       SCKEY_P1_E | SCKEY_P1_F | SCKEY_P1_G | SCKEY_P1_H |\
                       SCKEY_P1_I | SCKEY_P1_J | MKEY_CH3_MASK)
#endif
//# (SCKEY_P1_CH == CH3)

#if (SCKEY_P1_CH == CH4)
#undef SCKEY_P1_MASK
#define SCKEY_P1_MASK (SCKEY_P1_A | SCKEY_P1_B | SCKEY_P1_C | SCKEY_P1_D |\
                       SCKEY_P1_E | SCKEY_P1_F | SCKEY_P1_G | SCKEY_P1_H |\
                       SCKEY_P1_I | SCKEY_P1_J | MKEY_CH4_MASK)
#endif
//# (SCKEY_P1_CH == CH4)

/* RE-Define the 2nd Channel mask without ACTIVE_SHIELD_GROUP */
#if (NUMBER_OF_ACQUISITION_PORTS > 1)


#if (SCKEY_P2_CH == CH1)
#undef SCKEY_P2_MASK
#define SCKEY_P2_MASK (SCKEY_P2_A | SCKEY_P2_B | SCKEY_P2_C | SCKEY_P2_D |\
                       SCKEY_P2_E | SCKEY_P2_F | SCKEY_P2_G | SCKEY_P2_H |\
                       SCKEY_P2_I | SCKEY_P2_J | MKEY_CH1_MASK)
#endif
//# (SCKEY_P2_CH == CH1)

#if (SCKEY_P2_CH == CH2)
#undef SCKEY_P2_MASK
#define SCKEY_P2_MASK (SCKEY_P2_A | SCKEY_P2_B | SCKEY_P2_C | SCKEY_P2_D |\
                       SCKEY_P2_E | SCKEY_P2_F | SCKEY_P2_G | SCKEY_P2_H |\
                       SCKEY_P2_I | SCKEY_P2_J | MKEY_CH2_MASK)
#endif
//# (SCKEY_P2_CH == CH2)

#if (SCKEY_P2_CH == CH3)
#undef SCKEY_P2_MASK
#define SCKEY_P2_MASK (SCKEY_P2_A | SCKEY_P2_B | SCKEY_P2_C | SCKEY_P2_D |\
                       SCKEY_P2_E | SCKEY_P2_F | SCKEY_P2_G | SCKEY_P2_H |\
                       SCKEY_P2_I | SCKEY_P2_J | MKEY_CH3_MASK)
#endif
//# (SCKEY_P2_CH == CH3)

#if (SCKEY_P2_CH == CH4)
#undef SCKEY_P2_MASK
#define SCKEY_P2_MASK (SCKEY_P2_A | SCKEY_P2_B | SCKEY_P2_C | SCKEY_P2_D |\
                       SCKEY_P2_E | SCKEY_P2_F | SCKEY_P2_G | SCKEY_P2_H |\
                       SCKEY_P2_I | SCKEY_P2_J | MKEY_CH4_MASK)
#endif
//# (SCKEY_P2_CH == CH4)

#endif
//# (NUMBER_OF_ACQUISITION_PORTS > 1)

/* RE-Define the 3rd Channel mask without ACTIVE_SHIELD_GROUP */
#if (NUMBER_OF_ACQUISITION_PORTS > 2)


#if (SCKEY_P3_CH == CH1)
#undef SCKEY_P3_MASK
#define SCKEY_P3_MASK (SCKEY_P3_A | SCKEY_P3_B | SCKEY_P3_C | SCKEY_P3_D |\
                       SCKEY_P3_E | SCKEY_P3_F | SCKEY_P3_G | SCKEY_P3_H |\
                       SCKEY_P3_I | SCKEY_P3_J | MKEY_CH1_MASK)
#endif
//# (SCKEY_P2_CH == CH1)

#if (SCKEY_P3_CH == CH2)
#undef SCKEY_P3_MASK
#define SCKEY_P3_MASK (SCKEY_P3_A | SCKEY_P3_B | SCKEY_P3_C | SCKEY_P3_D |\
                       SCKEY_P3_E | SCKEY_P3_F | SCKEY_P3_G | SCKEY_P3_H |\
                       SCKEY_P3_I | SCKEY_P3_J | MKEY_CH2_MASK)
#endif
//# (SCKEY_P2_CH == CH2)

#if (SCKEY_P3_CH == CH3)
#undef SCKEY_P3_MASK
#define SCKEY_P3_MASK (SCKEY_P3_A | SCKEY_P3_B | SCKEY_P3_C | SCKEY_P3_D |\
                       SCKEY_P3_E | SCKEY_P3_F | SCKEY_P3_G | SCKEY_P3_H |\
                       SCKEY_P3_I | SCKEY_P3_J | MKEY_CH3_MASK)
#endif
//# (SCKEY_P2_CH == CH3)

#if (SCKEY_P3_CH == CH4)
#undef SCKEY_P3_MASK
#define SCKEY_P3_MASK (SCKEY_P3_A | SCKEY_P3_B | SCKEY_P3_C | SCKEY_P3_D |\
                       SCKEY_P3_E | SCKEY_P3_F | SCKEY_P3_G | SCKEY_P3_H |\
                       SCKEY_P3_I | SCKEY_P3_J | MKEY_CH4_MASK)
#endif
//# (SCKEY_P2_CH == CH4)

#endif
//# (NUMBER_OF_ACQUISITION_PORTS > 2)

#endif
//# (ACTIVE_SHIELD_CHANNEL > 0)

/* Initialize the SCKEY COMP1 masks */
#define SCKEY_P1_COMP1_MASK_A ((uint32_t)0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_A ((uint32_t)0x00000000)
/* Initialize the SCKEY  MODER_COMP1 masks */
#define SCKEY_P1_MODER_COMP1_MASK_A  ((uint32_t)0x00000000)
/* Initialize the SCKEY  MODER_COMP1_OUT masks */
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000000)
/* Initialize the SCKEY IO_COMP1 masks */
#define SCKEY_P1_IO_COMP1_MASK_A ((uint32_t)0x00000000)
/* Initialize the SCKEY COMP2 masks */
#define SCKEY_P1_COMP2_MASK_A ((uint32_t)0x00000000)
/* Initialize the SCKEY  STATE COMP2 masks */
#define SCKEY_P1_STATE_COMP2_MASK_A ((uint32_t)0x00000000)
/* Initialize the SCKEY  MODER_COMP2 masks */
#define SCKEY_P1_MODER_COMP2_MASK_A  ((uint32_t)0x00000000)
/* Initialize the SCKEY  MODER_COMP2_OUT masks */
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00000000)
/* Initialize the SCKEY IO_COMP2 masks */
#define SCKEY_P1_IO_COMP2_MASK_A ((uint32_t)0x00000000)
#define SCKEY_P1_COMP1_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B  ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P1_COMP1_MASK_C ((uint32_t)0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_C ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C  ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_C ((uint32_t)0x00000000)
#define SCKEY_P1_COMP2_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_B  ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P1_COMP2_MASK_C ((uint32_t)0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_C ((uint16_t)0x0000)
#define SCKEY_P1_MODER_COMP2_MASK_C  ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_C ((uint32_t)0x00000000)

/* Define the PORT1 comparator channel mask */
#if (SCKEY_P1_CH == CH1)

#ifdef PORT_A
#define P1_PORT_A              (GPIOA)
#define P1_IO_MASK_1           ((uint32_t)0x00000001)   /* PA0 */
#define P1_IO_MASK_2           ((uint32_t)0x00000040)   /* PA6 */
#define P1_IO_MASK_4           ((uint32_t)0x00000100)   /* PA8 */
#define P1_IO_MASK_5           ((uint32_t)0x00002000)   /* PA13 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_A
#undef SCKEY_P1_IO_COMP1_MASK_A
#undef SCKEY_P1_MODER_COMP1_MASK_A
#undef SCKEY_P1_MODER_COMP1_MASK_A_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_A
#if (((SCKEY_P1_MASK& GROUP1)== GROUP1) && ((SCKEY_P1_MASK&GROUP2)== GROUP2))
#define SCKEY_P1_COMP1_MASK_A           ((uint32_t)0x00000041)
#define SCKEY_P1_IO_COMP1_MASK_A        ((uint32_t)0x00000041) /* PA0 and PA6 */
#define SCKEY_P1_MODER_COMP1_MASK_A     ((uint32_t)0x00003003)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00001001)
#define SCKEY_P1_STATE_COMP1_MASK_A     ((uint16_t)0x0003)
#elif ((SCKEY_P1_MASK& GROUP1)== GROUP1)
#define SCKEY_P1_COMP1_MASK_A           ((uint32_t)0x00000001)
#define SCKEY_P1_IO_COMP1_MASK_A        ((uint32_t)0x00000001) /* PA0 */
#define SCKEY_P1_MODER_COMP1_MASK_A     ((uint32_t)0x00000003)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000001)
#define SCKEY_P1_STATE_COMP1_MASK_A     ((uint16_t)0x0001)
#elif ((SCKEY_P1_MASK&GROUP2)== GROUP2)
#define SCKEY_P1_COMP1_MASK_A           ((uint32_t)0x00000040)
#define SCKEY_P1_IO_COMP1_MASK_A       ((uint32_t)0x00000040) /* PA6 */
#define SCKEY_P1_MODER_COMP1_MASK_A     ((uint32_t)0x00003000)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00001000)
#define SCKEY_P1_STATE_COMP1_MASK_A     ((uint16_t)0x0002)
#else
#define SCKEY_P1_COMP1_MASK_A           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_A        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_A     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_A     (0x0000)
#endif
#endif

/* Only the comparator 2 is used */
#ifdef  COMP2
#undef SCKEY_P1_COMP2_MASK_A
#undef SCKEY_P1_IO_COMP2_MASK_A
#undef SCKEY_P1_MODER_COMP2_MASK_A
#undef SCKEY_P1_MODER_COMP2_MASK_A_OUT
#undef SCKEY_P1_STATE_COMP2_MASK_A
#if (((SCKEY_P1_MASK & GROUP4) == GROUP4) && ((SCKEY_P1_MASK & GROUP5)== GROUP5))
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000240)
#define SCKEY_P1_IO_COMP2_MASK_A        ((uint32_t)0x00002100) /* PA8 and PA13 */
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0x0C030000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x04010000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0018)
#elif ((SCKEY_P1_MASK & GROUP4) == GROUP4)
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000200)
#define SCKEY_P1_IO_COMP2_MASK_A        ((uint32_t)0x00000100) /* PA8 */
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0x00030000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00010000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0008)
#elif ((SCKEY_P1_MASK & GROUP5)== GROUP5)
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000040)
#define SCKEY_P1_IO_COMP2_MASK_A        ((uint32_t)0x00002000) /* PA13 */
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0x0C000000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x04000000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0010)
#else
#define SCKEY_P1_COMP2_MASK_A           (0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_A        (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_A     (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_A     (0x0000)
#endif
#endif
#endif
//# PORT_A

#ifdef PORT_B
#define P1_PORT_B              (GPIOB)
#define P1_IO_MASK_3           ((uint32_t)0x00000001)   /* PB0 */
#define P1_IO_MASK_7           ((uint32_t)0x00001000)   /* PB12 */
#define P1_IO_MASK_6           ((uint32_t)0x00000010)   /* PB4 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_B
#undef SCKEY_P1_IO_COMP1_MASK_B
#undef SCKEY_P1_MODER_COMP1_MASK_B
#undef SCKEY_P1_MODER_COMP1_MASK_B_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_B
#if (((SCKEY_P1_MASK & GROUP3) == GROUP3) && ((SCKEY_P1_MASK & GROUP7)== GROUP7))
#define SCKEY_P1_COMP1_MASK_B           ((uint32_t)0x00040100)
#define SCKEY_P1_IO_COMP1_MASK_B        ((uint32_t)0x00001001) /* PB0 and PB12 */
#define SCKEY_P1_MODER_COMP1_MASK_B     ((uint32_t)0x03000003)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT ((uint32_t)0x01000001)
#define SCKEY_P1_STATE_COMP1_MASK_B     ((uint16_t)0x0044)
#elif ((SCKEY_P1_MASK & GROUP3) == GROUP3)
#define SCKEY_P1_COMP1_MASK_B           ((uint32_t)0x00000100)
#define SCKEY_P1_IO_COMP1_MASK_B        ((uint32_t)0x00000001) /* PB0 */
#define SCKEY_P1_MODER_COMP1_MASK_B     ((uint32_t)0x00000003)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000001)
#define SCKEY_P1_STATE_COMP1_MASK_B     ((uint16_t)0x0004)
#elif ((SCKEY_P1_MASK & GROUP7)== GROUP7)
#define SCKEY_P1_COMP1_MASK_B           ((uint32_t)0x00040000)
#define SCKEY_P1_IO_COMP1_MASK_B        ((uint32_t)0x00001000) /* PB12 */
#define SCKEY_P1_MODER_COMP1_MASK_B     ((uint32_t)0x03000000)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT ((uint32_t)0x01000000)
#define SCKEY_P1_STATE_COMP1_MASK_B     ((uint16_t)0x0040)
#else
#define SCKEY_P1_COMP1_MASK_B           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_B        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_B     (0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P1_COMP2_MASK_B
#undef SCKEY_P1_IO_COMP2_MASK_B
#undef SCKEY_P1_MODER_COMP2_MASK_B
#undef SCKEY_P1_MODER_COMP2_MASK_B_OUT
#undef SCKEY_P1_STATE_COMP2_MASK_B
#if ((SCKEY_P1_MASK & GROUP6)== GROUP6)
#define SCKEY_P1_COMP2_MASK_B           ((uint32_t)0x00000010)
#define SCKEY_P1_IO_COMP2_MASK_B        ((uint32_t)0x00000010) /* PB4 */
#define SCKEY_P1_MODER_COMP2_MASK_B     ((uint32_t)0x00000300)
#define SCKEY_P1_MODER_COMP2_MASK_B_OUT ((uint32_t)0x00000100)
#define SCKEY_P1_STATE_COMP2_MASK_B     ((uint16_t)0x0020)
#else
#define SCKEY_P1_COMP2_MASK_B           (0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_B        (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_B     (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_B_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_B     (0x0000)
#endif
#endif
#endif
//# PORT_B

#ifdef PORT_C
#define P1_PORT_C              (GPIOC)
#define P1_IO_MASK_8           ((uint32_t)0x00000001)   /* PC0 */
#define P1_IO_MASK_9           ((uint32_t)0x00000010)  /* PC4 */
#define P1_IO_MASK_10          ((uint32_t)0x00000040) /* PC6 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_C
#undef SCKEY_P1_IO_COMP1_MASK_C
#undef SCKEY_P1_MODER_COMP1_MASK_C
#undef SCKEY_P1_MODER_COMP1_MASK_C_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_C
#if (((SCKEY_P1_MASK&GROUP8)== GROUP8) && ((SCKEY_P1_MASK&GROUP9)== GROUP9))
#define SCKEY_P1_COMP1_MASK_C           ((uint32_t)0x00004400)
#define SCKEY_P1_IO_COMP1_MASK_C        ((uint32_t)0x00000011)  /* PC0 and PC4 */
#define SCKEY_P1_MODER_COMP1_MASK_C     ((uint32_t)0x00000303)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000101)
#define SCKEY_P1_STATE_COMP1_MASK_C     ((uint16_t)0x0180)
#elif ((SCKEY_P1_MASK&GROUP8)== GROUP8)
#define SCKEY_P1_COMP1_MASK_C           ((uint32_t)0x00000400)
#define SCKEY_P1_IO_COMP1_MASK_C        ((uint32_t)0x00000001) /* PC0 */
#define SCKEY_P1_MODER_COMP1_MASK_C     ((uint32_t)0x00000003)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000001)
#define SCKEY_P1_STATE_COMP1_MASK_C     ((uint16_t)0x0080)
#elif ((SCKEY_P1_MASK&GROUP9)== GROUP9)
#define SCKEY_P1_COMP1_MASK_C           ((uint32_t)0x00004000)
#define SCKEY_P1_IO_COMP1_MASK_C        ((uint32_t)0x00000010) /* PC4 */
#define SCKEY_P1_MODER_COMP1_MASK_C     ((uint32_t)0x00000300)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000100)
#define SCKEY_P1_STATE_COMP1_MASK_C     ((uint16_t)0x0100)
#else
#define SCKEY_P1_COMP1_MASK_C           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_C        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_C     (0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P1_COMP2_MASK_C
#undef SCKEY_P1_IO_COMP2_MASK_C
#undef SCKEY_P1_MODER_COMP2_MASK_C
#undef SCKEY_P1_MODER_COMP2_MASK_C_OUT
#undef SCKEY_P1_STATE_COMP2_MASK_C
#if ((SCKEY_P1_MASK & GROUP10) == GROUP10)
#define SCKEY_P1_COMP2_MASK_C           ((uint32_t)0x00000001)
#define SCKEY_P1_IO_COMP2_MASK_C        ((uint32_t)0x00000040) /* PC6 */
#define SCKEY_P1_MODER_COMP2_MASK_C     ((uint32_t)0x00003000)
#define SCKEY_P1_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00001000)
#define SCKEY_P1_STATE_COMP2_MASK_C     ((uint16_t)0x0200)
#else
#define SCKEY_P1_COMP2_MASK_C           (0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_C        (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C     (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_C     (0x0000)
#endif
#endif
#endif
//# PORT_C

#endif
//# (SCKEY_P1_CH == CH1)

#if (SCKEY_P1_CH == CH2)

#ifdef PORT_A
#define P1_IO_PORT_A     (GPIOA)
#define P1_IO_MASK_1     ((uint32_t)0x00000002)   /* PA1 */
#define P1_IO_MASK_2     ((uint32_t)0x00000080)   /* PA7 */
#define P1_IO_MASK_4     ((uint32_t)0x00000200)   /* PA9 */
#define P1_IO_MASK_5     ((uint32_t)0x00004000)   /* PA14 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_A
#undef SCKEY_P1_IO_COMP1_MASK_A
#undef SCKEY_P1_MODER_COMP1_MASK_A
#undef SCKEY_P1_MODER_COMP1_MASK_A_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_A
#if (((SCKEY_P1_MASK & GROUP1) == GROUP1) && ((SCKEY_P1_MASK & GROUP2)== GROUP2))
#define SCKEY_P1_COMP1_MASK_A           ((uint32_t)0x00000082)
#define SCKEY_P1_IO_COMP1_MASK_A        ((uint32_t)0x00000082)  /*PA1 and PA7*/
#define SCKEY_P1_MODER_COMP1_MASK_A     ((uint32_t)0x0000C00C)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00004004)
#define SCKEY_P1_STATE_COMP1_MASK_A     ((uint16_t)0x0003)
#elif (((SCKEY_P1_MASK & GROUP1)== GROUP1) && ((SCKEY_P1_MASK & GROUP2)== 0))
#define SCKEY_P1_COMP1_MASK_A           ((uint32_t)0x00000002)
#define SCKEY_P1_IO_COMP1_MASK_A        ((uint32_t)0x00000002) /* PA1 */
#define SCKEY_P1_MODER_COMP1_MASK_A     ((uint32_t)0x0000000C)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000004)
#define SCKEY_P1_STATE_COMP1_MASK_A     ((uint16_t)0x0001)
#elif ((SCKEY_P1_MASK & GROUP1)== 0) && ((SCKEY_P1_MASK & GROUP2)== GROUP2)
#define SCKEY_P1_COMP1_MASK_A           ((uint32_t)0x00000080)
#define SCKEY_P1_IO_COMP1_MASK_A        ((uint32_t)0x00000080) /* PA7 */
#define SCKEY_P1_MODER_COMP1_MASK_A     ((uint32_t)0x0000C000)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00004000)
#define SCKEY_P1_STATE_COMP1_MASK_A     ((uint16_t)0x0002)
#else
#define SCKEY_P1_COMP1_MASK_A           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_A        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_A     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_A     (0x0000)
#endif
#else
#define SCKEY_P1_COMP1_MASK_A           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_A        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_A     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_A     (0x0000)
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P1_COMP2_MASK_A
#undef SCKEY_P1_IO_COMP2_MASK_A
#undef SCKEY_P1_MODER_COMP2_MASK_A
#undef SCKEY_P1_MODER_COMP2_MASK_A_OUT
#undef SCKEY_P1_STATE_COMP2_MASK_A
#if (((SCKEY_P1_MASK & GROUP4) == GROUP4) && ((SCKEY_P1_MASK & GROUP5)== GROUP5))
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000480)
#define SCKEY_P1_IO_COMP2_MASK_A        ((uint32_t)0x00004200) /* PA9 and PA14 */
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0x300C0000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x10040000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0018)
#elif (((SCKEY_P1_MASK & GROUP4)== GROUP4) && ((SCKEY_P1_MASK & GROUP5)== 0))
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000400)
#define SCKEY_P1_IO_COMP2_MASK_A        ((uint32_t)0x00000200) /* PA9 */
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0x000C0000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00040000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0008)
#elif ((SCKEY_P1_MASK & GROUP4)== 0) && ((SCKEY_P1_MASK & GROUP5)== GROUP5)
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000080)
#define SCKEY_P1_IO_COMP2_MASK _A       ((uint32_t)0x00004000) /* PA14 */
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0x30000000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x10000000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0010)
#else
#define SCKEY_P1_COMP2_MASK_A           (0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_A        (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_A     (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_A     (0x0000)
#endif
#endif
#endif
//# PORT_A

#ifdef PORT_B
#define P1_PORT_B              (GPIOB)
#define P1_IO_MASK_3           ((uint32_t)0x00000002)   /* PB1 */
#define P1_IO_MASK_7           ((uint32_t)0x00002000)   /* PB13 */
#define P1_IO_MASK_6           ((uint32_t)0x00000020)   /* PB5 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_B
#undef SCKEY_P1_IO_COMP1_MASK_B
#undef SCKEY_P1_MODER_COMP1_MASK_B
#undef SCKEY_P1_MODER_COMP1_MASK_B_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_B
#if ((((SCKEY_P1_MASK & GROUP3)== GROUP3) && ((SCKEY_P1_MASK & GROUP7)== GROUP7)))
#define SCKEY_P1_COMP1_MASK_B           ((uint32_t)0x00080200)
#define SCKEY_P1_IO_COMP1_MASK_B        ((uint32_t)0x00002002)  /* PB1 and PB13 */
#define SCKEY_P1_MODER_COMP1_MASK_B     ((uint32_t)0x0C00000C)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT ((uint32_t)0x04000004)
#define SCKEY_P1_STATE_COMP1_MASK_B     ((uint16_t)0x0044)
#elif ((SCKEY_P1_MASK & GROUP3)== GROUP3)
#define SCKEY_P1_COMP1_MASK_B           ((uint32_t)0x00000200)
#define SCKEY_P1_IO_COMP1_MASK_B        ((uint32_t)0x00000002) /* PB1 */
#define SCKEY_P1_MODER_COMP1_MASK_B     ((uint32_t)0x0000000C)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000004)
#define SCKEY_P1_STATE_COMP1_MASK_B     ((uint16_t)0x0004)
#elif (SCKEY_P1_MASK & GROUP7)== GROUP7
#define SCKEY_P1_COMP1_MASK_B           ((uint32_t)0x00080000)
#define SCKEY_P1_IO_COMP1_MASK_B        ((uint32_t)0x00002000) /* PB13 */
#define SCKEY_P1_MODER_COMP1_MASK_B     ((uint32_t)0x0C000000)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT ((uint32_t)0x04000000)
#define SCKEY_P1_STATE_COMP1_MASK_B     ((uint16_t)0x0040)
#else
#define SCKEY_P1_COMP1_MASK_B           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_B        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_B     (0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P1_COMP2_MASK_B
#undef SCKEY_P1_IO_COMP2_MASK_B
#undef SCKEY_P1_MODER_COMP2_MASK_B
#undef SCKEY_P1_MODER_COMP2_MASK_B_OUT
#undef SCKEY_P1_STATE_COMP2_MASK_B
#if ((SCKEY_P1_MASK & GROUP6)== GROUP6)
#define SCKEY_P1_COMP2_MASK_B           ((uint32_t)0x00000020)
#define SCKEY_P1_IO_COMP2_MASK_B        ((uint32_t)0x00000020) /* PB5 */
#define SCKEY_P1_MODER_COMP2_MASK_B     ((uint32_t)0x00000C00)
#define SCKEY_P1_MODER_COMP2_MASK_B_OUT ((uint32_t)0x00000400)
#define SCKEY_P1_STATE_COMP2_MASK_B     ((uint16_t)0x0020)
#else
#define SCKEY_P1_COMP2_MASK_B           (0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_B        (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_B     (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_B_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_B     (0x0000)
#endif
#endif
#endif
//# PORT_B

