TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
#ifdef PORT_C
#define P1_PORT_C              (GPIOC)
#define P1_IO_MASK_8           ((uint32_t)0x00000002)   /* PC1 */
#define P1_IO_MASK_9           ((uint32_t)0x00000020)   /* PC5 */
#define P1_IO_MASK_10          ((uint32_t)0x00000080)   /* PC7 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_C
#undef SCKEY_P1_IO_COMP1_MASK_C
#undef SCKEY_P1_MODER_COMP1_MASK_C
#undef SCKEY_P1_MODER_COMP1_MASK_C_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_C
#if (((SCKEY_P1_MASK & GROUP8)== GROUP8) && ((SCKEY_P1_MASK & GROUP9)== GROUP9))
#define SCKEY_P1_COMP1_MASK_C           ((uint32_t)0x00008800)
#define SCKEY_P1_IO_COMP1_MASK_C        ((uint32_t)0x00000022)  /* PC1 and PC5 */
#define SCKEY_P1_MODER_COMP1_MASK_C     ((uint32_t)0x00000C0C)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000404)
#define SCKEY_P1_STATE_COMP1_MASK_C     ((uint16_t)0x0180)
#elif ((SCKEY_P1_MASK & GROUP8)== GROUP8)
#define SCKEY_P1_COMP1_MASK_C           ((uint32_t)0x00000800)
#define SCKEY_P1_IO_COMP1_MASK_C        ((uint32_t)0x00000002) /* PC1 */
#define SCKEY_P1_MODER_COMP1_MASK_C     ((uint32_t)0x0000000C)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000004)
#define SCKEY_P1_STATE_COMP1_MASK_C     ((uint16_t)0x0080)
#elif ((SCKEY_P1_MASK & GROUP9)== GROUP9)
#define SCKEY_P1_COMP1_MASK_C           ((uint32_t)0x00008000)
#define SCKEY_P1_IO_COMP1_MASK_C        ((uint32_t)0x00000020) /* PC5 */
#define SCKEY_P1_MODER_COMP1_MASK_C     ((uint32_t)0x00000C00)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000400)
#define SCKEY_P1_STATE_COMP1_MASK_C     ((uint16_t)0x0100)
#else
#define SCKEY_P1_COMP1_MASK_C           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_C        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_C     (0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P1_COMP2_MASK_C
#undef SCKEY_P1_IO_COMP2_MASK_C
#undef SCKEY_P1_MODER_COMP2_MASK_C
#undef SCKEY_P1_MODER_COMP2_MASK_C_OUT
#undef SCKEY_P1_STATE_COMP2_MASK_C
#if ((SCKEY_P1_MASK & GROUP10)== GROUP10)
#define SCKEY_P1_COMP2_MASK_C           ((uint32_t)0x00000002)
#define SCKEY_P1_IO_COMP2_MASK_C        ((uint32_t)0x00000080) /* PC7 */
#define SCKEY_P1_MODER_COMP2_MASK_C     ((uint32_t)0x0000C000)
#define SCKEY_P1_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00004000)
#define SCKEY_P1_STATE_COMP2_MASK_C     ((uint32_t)0x0200)
#else
#define SCKEY_P1_COMP2_MASK_C           (0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_C        (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C     (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_C     (0x0000)
#endif
#endif
#endif
//# PORT_C

#endif
//# (SCKEY_P1_CH == CH2)

#if (SCKEY_P1_CH == CH3)

#ifdef PORT_A
#define P1_IO_PORT_A  (GPIOA)
#define P1_IO_MASK_1  ((uint32_t)0x00000004)   /* PA2 */
#define P1_IO_MASK_4  ((uint32_t)0x00000400)   /* PA10 */
#define P1_IO_MASK_5  ((uint32_t)0x00008000)   /* PA15 */
#undef SCKEY_P1_COMP1_MASK_A
#undef SCKEY_P1_IO_COMP1_MASK_A
#undef SCKEY_P1_MODER_COMP1_MASK_A
#undef SCKEY_P1_MODER_COMP1_MASK_A_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_A
#undef SCKEY_P1_COMP2_MASK_A
#undef SCKEY_P1_IO_COMP2_MASK_A
#undef SCKEY_P1_MODER_COMP2_MASK_A
#undef SCKEY_P1_MODER_COMP2_MASK_A_OUT
#undef SCKEY_P1_STATE_COMP2_MASK_A
#ifdef COMP1
#if ((SCKEY_P1_MASK & GROUP1)== GROUP1)
#define SCKEY_P1_COMP1_MASK_A           ((uint32_t)0x00000004)
#define SCKEY_P1_IO_COMP1_MASK_A        ((uint32_t)0x00000004)  /* PA2 */
#define SCKEY_P1_MODER_COMP1_MASK_A     ((uint32_t)0x00000030)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000010)
#define SCKEY_P1_STATE_COMP1_MASK_A     ((uint16_t)0x0001)
#else
#define SCKEY_P1_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_A     ((uint16_t)0x0000)
#endif
#endif
#ifdef COMP2
#if  ((SCKEY_P1_MASK & GROUP4) == GROUP4) &&  ((SCKEY_P1_MASK & GROUP5) == GROUP5)
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000900)
#define SCKEY_P1_IO_COMP2_MASK_A        ((uint32_t)0x00008400) /* PA10 and PA15 */
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0xC0300000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x40100000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0018)
#elif ((SCKEY_P1_MASK & GROUP4) == GROUP4) &&  ((SCKEY_P1_MASK & GROUP5) == 0)
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000800)
#define SCKEY_P1_IO_COMP2_MASK_A        ((uint32_t)0x00000400) /* PA10 */
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0x00300000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00100000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0008)
#elif ((SCKEY_P1_MASK & GROUP4) == 0) &&  ((SCKEY_P1_MASK & GROUP5) == GROUP5)
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000100)
#define SCKEY_P1_IO_COMP2_MASK_A        ((uint32_t)0x00008000) /* PA15 */
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0xC0000000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x40000000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0010)
#else
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0000)
#endif
#else
#define SCKEY_P1_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_A     ((uint16_t)0x0000)
#endif
#endif
//# PORT_A

#ifdef PORT_B
#define P1_PORT_B     (GPIOB)
#define P1_IO_MASK_7  ((uint32_t)0x00004000)   /* PB14 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_B
#undef SCKEY_P1_IO_COMP1_MASK_B
#undef SCKEY_P1_MODER_COMP1_MASK_B
#undef SCKEY_P1_MODER_COMP1_MASK_B_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_B
#if ((SCKEY_P1_MASK & GROUP7)== GROUP7)
#define SCKEY_P1_COMP1_MASK_B           ((uint32_t)0x00100000)
#define SCKEY_P1_IO_COMP1_MASK_B        ((uint32_t)0x00004000)  /* PB14 */
#define SCKEY_P1_MODER_COMP1_MASK_B     ((uint32_t)0x30000000)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT ((uint32_t)0x10000000)
#define SCKEY_P1_STATE_COMP1_MASK_B     ((uint16_t)0x0040)
#else
#define SCKEY_P1_COMP1_MASK_B           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_B        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_B     (0x0000)
#endif
#else
#define SCKEY_P1_COMP1_MASK_B           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_B        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_B     (0x0000)
#define SCKEY_P2_COMP1_MASK_B           (0x00000000)
#define SCKEY_P2_IO_COMP1_MASK_B        (0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_B     (0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_B_OUT (0x00000000)
#define SCKEY_P2_STATE_COMP1_MASK_B     (0x0000)
#endif
#endif
//# PORT_B

#ifdef PORT_C
#define P1_PORT_C     (GPIOC)
#define P1_IO_MASK_8  (0x00000004)   /* PC2 */
#define P1_IO_MASK_10 (0x00000100)  /* PC8 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_C
#undef SCKEY_P1_IO_COMP1_MASK_C
#undef SCKEY_P1_MODER_COMP1_MASK_C
#undef SCKEY_P1_MODER_COMP1_MASK_C_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_C
#if ((SCKEY_P1_MASK & GROUP8) == GROUP8)
#define SCKEY_P1_COMP1_MASK_C           ((uint32_t)0x00001000)
#define SCKEY_P1_IO_COMP1_MASK_C        ((uint32_t)0x00000004)  /* PC2 */
#define SCKEY_P1_MODER_COMP1_MASK_C     ((uint32_t)0x00000030)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000010)
#define SCKEY_P1_STATE_COMP1_MASK_C     ((uint16_t)0x0080)
#else
#define SCKEY_P1_COMP1_MASK_C           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_C        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_C     (0x0000)
#endif
#else
#define SCKEY_P1_COMP1_MASK_C           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_C        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_C     (0x0000)
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P1_COMP2_MASK_C
#undef SCKEY_P1_IO_COMP2_MASK_C
#undef SCKEY_P1_MODER_COMP2_MASK_C
#undef SCKEY_P1_MODER_COMP2_MASK_C_OUT
#undef SCKEY_P1_STATE_COMP2_MASK_C
#if ((SCKEY_P1_MASK & GROUP10) == GROUP10)
#define SCKEY_P1_COMP2_MASK_C           ((uint32_t)0x00000004)
#define SCKEY_P1_IO_COMP2_MASK_C        ((uint32_t)0x00000100) /* PC8 */
#define SCKEY_P1_MODER_COMP2_MASK_C     ((uint32_t)0x00030000)
#define SCKEY_P1_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00010000)
#define SCKEY_P1_STATE_COMP2_MASK_C     ((uint16_t)0x0200)
#else
#define SCKEY_P1_COMP2_MASK_C           (0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_C        (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C     (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_C     (0x0000)
#endif
#else
#define SCKEY_P1_COMP2_MASK_C           (0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_C        (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C     (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_C     (0x0000)
#endif
#endif
//# PORT_C

#endif
//# (SCKEY_P1_CH == CH3)

#if (SCKEY_P1_CH == CH4)

#ifdef PORT_A
#define P1_PORT_A     (GPIOA)
#define P1_IO_MASK_1  (0x00000008)   /* PA3 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_A
#undef SCKEY_P1_IO_COMP1_MASK_A
#undef SCKEY_P1_MODER_COMP1_MASK_A
#undef SCKEY_P1_MODER_COMP1_MASK_A_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_A
#if ((SCKEY_P1_MASK & GROUP1) == GROUP1)
#define SCKEY_P1_COMP1_MASK_A           ((uint32_t)0x00000008)
#define SCKEY_P1_IO_COMP1_MASK_A        ((uint32_t)0x00000008)  /* PA3 */
#define SCKEY_P1_MODER_COMP1_MASK_A     ((uint32_t)0x000000C0)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000040)
#define SCKEY_P1_STATE_COMP1_MASK_A     ((uint16_t)0x0001)
#else
#define SCKEY_P1_COMP1_MASK_A           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_A        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_A     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_A_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_A     (0x0000)
#endif
#endif
#endif
//# PORT_A

#ifdef PORT_B
#define P1_PORT_B     (GPIOB)
#define P1_IO_MASK_7  ((uint32_t)0x00008000)   /* PB15 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_B
#undef SCKEY_P1_IO_COMP1_MASK_B
#undef SCKEY_P1_MODER_COMP1_MASK_B
#undef SCKEY_P1_MODER_COMP1_MASK_B_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_B
#if ((SCKEY_P1_MASK & GROUP7) == GROUP7)
#define SCKEY_P1_COMP1_MASK_B           ((uint32_t)0x00200000)
#define SCKEY_P1_IO_COMP1_MASK_B        ((uint32_t)0x00008000)  /* PB15 */
#define SCKEY_P1_MODER_COMP1_MASK_B     ((uint32_t)0xC0000000)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT ((uint32_t)0x40000000)
#define SCKEY_P1_STATE_COMP1_MASK_B     ((uint16_t)0x0040)
#else
#define SCKEY_P1_COMP1_MASK_B           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_B        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_B_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_B     (0x0000)
#endif
#endif
#endif
//# PORT_B

#ifdef PORT_C
#define P1_PORT_C           (GPIOC)
#define P1_IO_MASK_8        ((uint32_t)0x00000008)   /* PC3 */
#define P1_IO_MASK_10       ((uint32_t)0x00000200) /* PC9 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P1_COMP1_MASK_C
#undef SCKEY_P1_IO_COMP1_MASK_C
#undef SCKEY_P1_MODER_COMP1_MASK_C
#undef SCKEY_P1_MODER_COMP1_MASK_C_OUT
#undef SCKEY_P1_STATE_COMP1_MASK_C
#if ((SCKEY_P1_MASK & GROUP8)== GROUP8)
#define SCKEY_P1_COMP1_MASK_C           ((uint32_t)0x00002000)
#define SCKEY_P1_IO_COMP1_MASK_C        ((uint32_t)0x00000008)  /* PC3 */
#define SCKEY_P1_MODER_COMP1_MASK_C     ((uint32_t)0x000000C0)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000040)
#define SCKEY_P1_STATE_COMP1_MASK_C     ((uint16_t)0x0080)
#else
#define SCKEY_P1_COMP1_MASK_C           (0x00000000)
#define SCKEY_P1_IO_COMP1_MASK_C        (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C     (0x00000000)
#define SCKEY_P1_MODER_COMP1_MASK_C_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP1_MASK_C     (0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P1_COMP2_MASK_C
#undef SCKEY_P1_IO_COMP2_MASK_C
#undef SCKEY_P1_MODER_COMP2_MASK_C
#undef SCKEY_P1_MODER_COMP2_MASK_C_OUT
#undef SCKEY_P1_STATE_COMP2_MASK_C
#if ((SCKEY_P1_MASK & GROUP10)== GROUP10)
#define SCKEY_P1_COMP2_MASK_C           ((uint32_t)0x00000008)
#define SCKEY_P1_IO_COMP2_MASK_C        ((uint32_t)0x00000200) /* PC9 */
#define SCKEY_P1_MODER_COMP2_MASK_C     ((uint32_t)0x000C0000)
#define SCKEY_P1_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00040000)
#define SCKEY_P1_STATE_COMP2_MASK_C     ((uint16_t)0x0200)
#else
#define SCKEY_P1_COMP2_MASK_C           (0x00000000)
#define SCKEY_P1_IO_COMP2_MASK_C        (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C     (0x00000000)
#define SCKEY_P1_MODER_COMP2_MASK_C_OUT (0x00000000)
#define SCKEY_P1_STATE_COMP2_MASK_C     (0x0000)
#endif
#endif
#endif
//# PORT_C

#endif
//# (SCKEY_P1_CH == CH4)

