TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
#if (SCKEY_P2_CH == CH3)

#ifdef PORT_A
#define P2_IO_PORT_A  (GPIOA)
#define P2_IO_MASK_1  ((uint32_t)0x00000004)   /* PA2 */
#define P2_IO_MASK_4  ((uint32_t)0x00000400)   /* PA10 */
#define P2_IO_MASK_5  ((uint32_t)0x00008000)   /* PA15 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P2_COMP1_MASK_A
#undef SCKEY_P2_IO_COMP1_MASK_A
#undef SCKEY_P2_MODER_COMP1_MASK_A
#undef SCKEY_P2_MODER_COMP1_MASK_A_OUT
#undef SCKEY_P2_STATE_COMP1_MASK_A
#if ((SCKEY_P2_MASK & GROUP1)== GROUP1)
#define SCKEY_P2_COMP1_MASK_A           ((uint32_t)0x00000004)
#define SCKEY_P2_IO_COMP1_MASK_A        ((uint32_t)0x00000004)  /* PA2 */
#define SCKEY_P2_MODER_COMP1_MASK_A     ((uint32_t)0x00000030)
#define SCKEY_P2_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000010)
#define SCKEY_P2_STATE_COMP1_MASK_A     ((uint16_t)0x0001)
#else
#define SCKEY_P2_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P2_IO_COMP1_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P2_STATE_COMP1_MASK_A     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P2_COMP2_MASK_A
#undef SCKEY_P2_IO_COMP2_MASK_A
#undef SCKEY_P2_MODER_COMP2_MASK_A
#undef SCKEY_P2_MODER_COMP2_MASK_A_OUT
#undef SCKEY_P2_STATE_COMP2_MASK_A
#if  (((SCKEY_P2_MASK & GROUP4) == GROUP4) &&  ((SCKEY_P2_MASK & GROUP5) == GROUP5))
#define SCKEY_P2_COMP2_MASK_A           ((uint32_t)0x00000900)
#define SCKEY_P2_IO_COMP2_MASK_A        ((uint32_t)0x00008400) /* PA10 and PA15 */
#define SCKEY_P2_MODER_COMP2_MASK_A     ((uint32_t)0xC0300000)
#define SCKEY_P2_MODER_COMP2_MASK_A_OUT ((uint32_t)0x40100000)
#define SCKEY_P2_STATE_COMP2_MASK_A     ((uint16_t)0x0018)
#elif ((SCKEY_P2_MASK & GROUP4) == GROUP4)
#define SCKEY_P2_COMP2_MASK_A           ((uint32_t)0x00000800)
#define SCKEY_P2_IO_COMP2_MASK_A        ((uint32_t)0x00000400) /* PA10 */
#define SCKEY_P2_MODER_COMP2_MASK_A     ((uint32_t)0x00300000)
#define SCKEY_P2_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00100000)
#define SCKEY_P2_STATE_COMP2_MASK_A     ((uint16_t)0x0008)
#elif ((SCKEY_P2_MASK & GROUP5) == GROUP5)
#define SCKEY_P2_COMP2_MASK_A           ((uint32_t)0x00000100)
#define SCKEY_P2_IO_COMP2_MASK_A        ((uint32_t)0x00008000) /* PA15 */
#define SCKEY_P2_MODER_COMP2_MASK_A     ((uint32_t)0xC0000000)
#define SCKEY_P2_MODER_COMP2_MASK_A_OUT ((uint32_t)0x40000000)
#define SCKEY_P2_STATE_COMP2_MASK_A     ((uint16_t)0x0010)
#else
#define SCKEY_P2_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P2_IO_COMP2_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP2_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P2_STATE_COMP2_MASK_A     ((uint16_t)0x0000)
#endif
#endif
#endif
//# PORT_A

#ifdef PORT_B
#define P2_PORT_B     (GPIOB)
#define P2_IO_MASK_7  ((uint32_t)0x00004000)   /* PB14 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P2_COMP1_MASK_B
#undef SCKEY_P2_IO_COMP1_MASK_B
#undef SCKEY_P2_MODER_COMP1_MASK_B
#undef SCKEY_P2_MODER_COMP1_MASK_B_OUT
#undef SCKEY_P2_STATE_COMP1_MASK_B
#if ((SCKEY_P2_MASK & GROUP7)== GROUP7)
#define SCKEY_P2_COMP1_MASK_B           ((uint32_t)0x00100000)
#define SCKEY_P2_IO_COMP1_MASK_B        ((uint32_t)0x00004000)  /* PB14 */
#define SCKEY_P2_MODER_COMP1_MASK_B     ((uint32_t)0x30000000)
#define SCKEY_P2_MODER_COMP1_MASK_B_OUT ((uint32_t)0x10000000)
#define SCKEY_P2_STATE_COMP1_MASK_B     ((uint16_t)0x0040)
#else
#define SCKEY_P2_COMP1_MASK_B           ((uint32_t)0x00000000)
#define SCKEY_P2_IO_COMP1_MASK_B        ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_B     ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P2_STATE_COMP1_MASK_B     ((uint16_t)0x0000)
#endif
#endif
#endif
//# PORT_B

#ifdef PORT_C
#define P2_PORT_C     (GPIOC)
#define P2_IO_MASK_8  ((uint32_t)0x00000004)   /* PC2 */
#define P2_IO_MASK_10 ((uint32_t)0x00000100)  /* PC8 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P2_COMP1_MASK_C
#undef SCKEY_P2_IO_COMP1_MASK_C
#undef SCKEY_P2_MODER_COMP1_MASK_C
#undef SCKEY_P2_MODER_COMP1_MASK_C_OUT
#undef SCKEY_P2_STATE_COMP1_MASK_C
#if ((SCKEY_P2_MASK & GROUP8) == GROUP8)
#define SCKEY_P2_COMP1_MASK_C           ((uint32_t)0x00001000)
#define SCKEY_P2_IO_COMP1_MASK_C        ((uint32_t)0x00000004)  /* PC2 */
#define SCKEY_P2_MODER_COMP1_MASK_C     ((uint32_t)0x00000030)
#define SCKEY_P2_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000010)
#define SCKEY_P2_STATE_COMP1_MASK_C     ((uint16_t)0x0080)
#else
#define SCKEY_P2_COMP1_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P2_IO_COMP1_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P2_STATE_COMP1_MASK_C     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P2_COMP2_MASK_C
#undef SCKEY_P2_IO_COMP2_MASK_C
#undef SCKEY_P2_MODER_COMP2_MASK_C
#undef SCKEY_P2_MODER_COMP2_MASK_C_OUT
#undef SCKEY_P2_STATE_COMP2_MASK_C
#if ((SCKEY_P2_MASK & GROUP10) == GROUP10)
#define SCKEY_P2_COMP2_MASK_C           ((uint32_t)0x00000004)
#define SCKEY_P2_IO_COMP2_MASK_C        ((uint32_t)0x00000100) /* PC8 */
#define SCKEY_P2_MODER_COMP2_MASK_C     ((uint32_t)0x00030000)
#define SCKEY_P2_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00010000)
#define SCKEY_P2_STATE_COMP2_MASK_C     ((uint16_t)0x0200)
#else
#define SCKEY_P2_COMP2_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P2_IO_COMP2_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP2_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P2_STATE_COMP2_MASK_C     ((uint16_t)0x0000)
#endif
#endif
#endif
//# PORT_C

#endif
//# (SCKEY_P2_CH == CH3)

#if (SCKEY_P2_CH == CH4)

#ifdef PORT_A
#define P2_PORT_A     (GPIOA)
#define P2_IO_MASK_1  ((uint32_t)0x00000008)   /* PA3 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P2_COMP1_MASK_A
#undef SCKEY_P2_IO_COMP1_MASK_A
#undef SCKEY_P2_MODER_COMP1_MASK_A
#undef SCKEY_P2_MODER_COMP1_MASK_A_OUT
#undef SCKEY_P2_STATE_COMP1_MASK_A
#if ((SCKEY_P2_MASK & GROUP1) == GROUP1)
#define SCKEY_P2_COMP1_MASK_A           ((uint32_t)0x00000008)
#define SCKEY_P2_IO_COMP1_MASK_A        ((uint32_t)0x00000008)  /* PA3 */
#define SCKEY_P2_MODER_COMP1_MASK_A     ((uint32_t)0x000000C0)
#define SCKEY_P2_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000040)
#define SCKEY_P2_STATE_COMP1_MASK_A     ((uint16_t)0x0001)
#else
#define SCKEY_P2_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P2_IO_COMP1_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P2_STATE_COMP1_MASK_A     ((uint16_t)0x0000)
#endif
#endif
#endif
//# PORT_A

#ifdef PORT_B
#define P2_PORT_B     (GPIOB)
#define P2_IO_MASK_7  ((uint32_t)0x00008000)   /* PB15 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P2_COMP1_MASK_B
#undef SCKEY_P2_IO_COMP1_MASK_B
#undef SCKEY_P2_MODER_COMP1_MASK_B
#undef SCKEY_P2_MODER_COMP1_MASK_B_OUT
#undef SCKEY_P2_STATE_COMP1_MASK_B
#if ((SCKEY_P2_MASK & GROUP7) == GROUP7)
#define SCKEY_P2_COMP1_MASK_B           ((uint32_t)0x00200000)
#define SCKEY_P2_IO_COMP1_MASK_B        ((uint32_t)0x00008000)  /* PB15 */
#define SCKEY_P2_MODER_COMP1_MASK_B     ((uint32_t)0xC0000000)
#define SCKEY_P2_MODER_COMP1_MASK_B_OUT ((uint32_t)0x40000000)
#define SCKEY_P2_STATE_COMP1_MASK_B     ((uint16_t)0x0040)
#else
#define SCKEY_P2_COMP1_MASK_B           ((uint32_t)0x00000000)
#define SCKEY_P2_IO_COMP1_MASK_B        ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_B     ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P2_STATE_COMP1_MASK_B     ((uint16_t)0x0000)
#endif
#endif
#endif
//# PORT_B

#ifdef PORT_C
#define P2_PORT_C           (GPIOC)
#define P2_IO_MASK_8        ((uint32_t)0x00000008)   /* PC3 */
#define P2_IO_MASK_10       ((uint32_t)0x00000200) /* PC9 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P2_COMP1_MASK_C
#undef SCKEY_P2_IO_COMP1_MASK_C
#undef SCKEY_P2_MODER_COMP1_MASK_C
#undef SCKEY_P2_MODER_COMP1_MASK_C_OUT
#undef SCKEY_P2_STATE_COMP1_MASK_C
#if ((SCKEY_P2_MASK & GROUP8)== GROUP8)
#define SCKEY_P2_COMP1_MASK_C           ((uint32_t)0x00002000)
#define SCKEY_P2_IO_COMP1_MASK_C        ((uint32_t)0x00000008)  /* PC3 */
#define SCKEY_P2_MODER_COMP1_MASK_C     ((uint32_t)0x000000C0)
#define SCKEY_P2_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000040)
#define SCKEY_P2_STATE_COMP1_MASK_C     ((uint16_t)0x0080)
#else
#define SCKEY_P2_COMP1_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P2_IO_COMP1_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P2_STATE_COMP1_MASK_C     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P2_COMP2_MASK_C
#undef SCKEY_P2_IO_COMP2_MASK_C
#undef SCKEY_P2_MODER_COMP2_MASK_C
#undef SCKEY_P2_MODER_COMP2_MASK_C_OUT
#undef SCKEY_P2_STATE_COMP2_MASK_C
#if ((SCKEY_P2_MASK & GROUP10)== GROUP10)
#define SCKEY_P2_COMP2_MASK_C           ((uint32_t)0x00000008)
#define SCKEY_P2_IO_COMP2_MASK_C        ((uint32_t)0x00000200) /* PC9 */
#define SCKEY_P2_MODER_COMP2_MASK_C     ((uint32_t)0x000C0000)
#define SCKEY_P2_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00040000)
#define SCKEY_P2_STATE_COMP2_MASK_C     ((uint16_t)0x0200)
#else
#define SCKEY_P2_COMP2_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P2_IO_COMP2_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP2_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P2_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P2_STATE_COMP2_MASK_C     ((uint16_t)0x0000)
#endif
#endif
#endif
//# PORT_C

#endif
//# (SCKEY_P2_CH == CH4)

#endif
//# NUMBER_OF_ACQUISITION_PORTS > 1

#define SCKEY_P2_STATE_COMP1_MASK (SCKEY_P2_STATE_COMP1_MASK_A | SCKEY_P2_STATE_COMP1_MASK_B | SCKEY_P2_STATE_COMP1_MASK_C)
#define SCKEY_P2_STATE_COMP2_MASK (SCKEY_P2_STATE_COMP2_MASK_A | SCKEY_P2_STATE_COMP2_MASK_B | SCKEY_P2_STATE_COMP2_MASK_C)

#define SCKEY_P2_STATE_MASK (SCKEY_P2_STATE_COMP1_MASK | SCKEY_P2_STATE_COMP2_MASK)

#define P2_MODER_MASK_A_OUT (SCKEY_P2_MODER_COMP1_MASK_A_OUT | SCKEY_P2_MODER_COMP2_MASK_A_OUT | SHIELD_MODER_MASK_A_OUT)
#define P2_MODER_MASK_B_OUT (SCKEY_P2_MODER_COMP1_MASK_B_OUT | SCKEY_P2_MODER_COMP2_MASK_B_OUT | SHIELD_MODER_MASK_B_OUT)
#define P2_MODER_MASK_C_OUT (SCKEY_P2_MODER_COMP1_MASK_C_OUT | SCKEY_P2_MODER_COMP2_MASK_C_OUT | SHIELD_MODER_MASK_C_OUT)

#define P2_MODER_MASK_A (SCKEY_P2_MODER_COMP1_MASK_A | SCKEY_P2_MODER_COMP2_MASK_A | SHIELD_MODER_MASK_A)
#define P2_MODER_MASK_B (SCKEY_P2_MODER_COMP1_MASK_B | SCKEY_P2_MODER_COMP2_MASK_B | SHIELD_MODER_MASK_B)
#define P2_MODER_MASK_C (SCKEY_P2_MODER_COMP1_MASK_C | SCKEY_P2_MODER_COMP2_MASK_C | SHIELD_MODER_MASK_C)

#define P2_COMP1_MASK (SCKEY_P2_COMP1_MASK_A | SCKEY_P2_COMP1_MASK_B | SCKEY_P2_COMP1_MASK_C | SHIELD_COMP1_MASK)
#define P2_COMP2_MASK (SCKEY_P2_COMP2_MASK_A | SCKEY_P2_COMP2_MASK_B | SCKEY_P2_COMP2_MASK_C | SHIELD_COMP2_MASK)

#define P2_IO_MASK_A (SCKEY_P2_IO_COMP1_MASK_A | SCKEY_P2_IO_COMP2_MASK_A | SHIELD_IO_MASK_A)
#define P2_IO_MASK_B (SCKEY_P2_IO_COMP1_MASK_B | SCKEY_P2_IO_COMP2_MASK_B | SHIELD_IO_MASK_B)
#define P2_IO_MASK_C (SCKEY_P2_IO_COMP1_MASK_C | SCKEY_P2_IO_COMP2_MASK_C | SHIELD_IO_MASK_C)

/* Initialize the SCKEY COMP1 masks */
#define SCKEY_P3_COMP1_MASK_A ((uint32_t)0x00000000)
/* Initialize the SCKEY  STATE COMP1 masks */
#define SCKEY_P3_STATE_COMP1_MASK_A ((uint32_t)0x00000000)
/* Initialize the SCKEY  MODER_COMP1 masks */
#define SCKEY_P3_MODER_COMP1_MASK_A  ((uint32_t)0x00000000)
/* Initialize the SCKEY  MODER_COMP1_OUT masks */
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000000)
/* Initialize the SCKEY IO_COMP1 masks */
#define SCKEY_P3_IO_COMP1_MASK_A ((uint32_t)0x00000000)
#define SCKEY_P3_COMP1_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_B  ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P3_COMP1_MASK_C ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_C ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_C  ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_C ((uint32_t)0x00000000)

/* Initialize the SCKEY COMP2 masks */
#define SCKEY_P3_COMP2_MASK_A ((uint32_t)0x00000000)
/* Initialize the SCKEY  STATE COMP2 masks */
#define SCKEY_P3_STATE_COMP2_MASK_A ((uint32_t)0x00000000)
/* Initialize the SCKEY  MODER_COMP2 masks */
#define SCKEY_P3_MODER_COMP2_MASK_A  ((uint32_t)0x00000000)
/* Initialize the SCKEY  MODER_COMP2_OUT masks */
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00000000)
/* Initialize the SCKEY IO_COMP2 masks */
#define SCKEY_P3_IO_COMP2_MASK_A ((uint32_t)0x00000000)
#define SCKEY_P3_COMP2_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_B  ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_B ((uint32_t)0x00000000)
#define SCKEY_P3_COMP2_MASK_C ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_C ((uint16_t)0x0000)
#define SCKEY_P3_MODER_COMP2_MASK_C  ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_C ((uint32_t)0x00000000)

/* Define the PORT3 comparator channel mask */
#if (NUMBER_OF_SINGLE_CHANNEL_PORTS > 2) || (NUMBER_OF_MULTI_CHANNEL_KEYS > 0)

#if (SCKEY_P3_CH == CH1)

#ifdef PORT_A
#define P3_PORT_A              (GPIOA)
#define P3_IO_MASK_1           ((uint32_t)0x00000001)   /* PA0 */
#define P3_IO_MASK_2           ((uint32_t)0x00000040)   /* PA6 */
#define P3_IO_MASK_4           ((uint32_t)0x00000100)   /* PA8 */
#define P3_IO_MASK_5           ((uint32_t)0x00002000)   /* PA13 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_A
#undef SCKEY_P3_IO_COMP1_MASK_A
#undef SCKEY_P3_MODER_COMP1_MASK_A
#undef SCKEY_P3_MODER_COMP1_MASK_A_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_A
#if (((SCKEY_P3_MASK& GROUP1)== GROUP1) && ((SCKEY_P1_MASK&GROUP2)== GROUP2))
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000041)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000041) /* PA0 and PA6 */
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x00003003)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00001001)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0003)
#elif ((SCKEY_P3_MASK& GROUP1)== GROUP1)
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000001)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000001) /* PA0 */
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x00000003)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000001)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint32_t)0x0001)
#elif ((SCKEY_P3_MASK&GROUP2)== GROUP2)
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000040)
#define SCKEY_P3_IO_COMP1_MASK _A       ((uint32_t)0x00000040) /* PA6 */
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x00003000)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00001000)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0002)
#else
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef  COMP2
#undef SCKEY_P3_COMP2_MASK_A
#undef SCKEY_P3_IO_COMP2_MASK_A
#undef SCKEY_P3_MODER_COMP2_MASK_A
#undef SCKEY_P3_MODER_COMP2_MASK_A_OUT
#undef SCKEY_P3_STATE_COMP2_MASK_A
#if (((SCKEY_P3_MASK & GROUP4) == GROUP4) && ((SCKEY_P3_MASK & GROUP5)== GROUP5))
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000240)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00002100) /* PA8 and PA13 */
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0x0C030000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x04010000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint32_t)0x0018)
#elif ((SCKEY_P3_MASK & GROUP4) == GROUP4)
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000200)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00000100) /* PA8 */
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0x00030000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00010000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint16_t)0x0008)
#elif ((SCKEY_P3_MASK & GROUP5)== GROUP5)
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000040)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00002000) /* PA13 */
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0x0C000000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x04000000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint16_t)0x0010)
#else
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint16_t)0x0000)
#endif
#endif

#endif
//# PORT_A

#ifdef PORT_B
#define P3_PORT_B              (GPIOB)
#define P3_IO_MASK_3           ((uint32_t)0x00000001)   /* PB0 */
#define P3_IO_MASK_7           ((uint32_t)0x00001000)   /* PB12 */
#define P3_IO_MASK_6           ((uint32_t)0x00000010)   /* PB4 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_B
#undef SCKEY_P3_IO_COMP1_MASK_B
#undef SCKEY_P3_MODER_COMP1_MASK_B
#undef SCKEY_P3_MODER_COMP1_MASK_B_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_B
#if (((SCKEY_P3_MASK & GROUP3) == GROUP3) && ((SCKEY_P3_MASK & GROUP7)== GROUP7))
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00040100)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00001001) /* PB0 and PB12 */
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x03000003)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x01000001)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint32_t)0x0044)
#elif ((SCKEY_P3_MASK & GROUP3) == GROUP3)
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00000100)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00000001) /* PB0 */
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x00000003)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000001)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0004)
#elif ((SCKEY_P3_MASK & GROUP7)== GROUP7)
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00040000)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00001000) /* PB12 */
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x03000000)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x01000000)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0040)
#else
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P3_COMP2_MASK_B
#undef SCKEY_P3_IO_COMP2_MASK_B
#undef SCKEY_P3_MODER_COMP2_MASK_B
#undef SCKEY_P3_MODER_COMP2_MASK_B_OUT
#undef SCKEY_P3_STATE_COMP2_MASK_B
#if ((SCKEY_P3_MASK & GROUP6)== GROUP6)
#define SCKEY_P3_COMP2_MASK_B           ((uint32_t)0x00000010)
#define SCKEY_P3_IO_COMP2_MASK_B        ((uint32_t)0x00000010) /* PB4 */
#define SCKEY_P3_MODER_COMP2_MASK_B     ((uint32_t)0x00000300)
#define SCKEY_P3_MODER_COMP2_MASK_B_OUT ((uint32_t)0x00000100)
#define SCKEY_P3_STATE_COMP2_MASK_B     ((uint32_t)0x0020)
#else
#define SCKEY_P3_COMP2_MASK_B           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_B        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_B     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_B     ((uint16_t)0x0000)
#endif
#endif

#endif
//# PORT_B

#ifdef PORT_C
#define P3_PORT_C              (GPIOC)
#define P3_IO_MASK_8           ((uint32_t)0x00000001)   /* PC0 */
#define P3_IO_MASK_9           ((uint32_t)0x00000010)  /* PC4 */
#define P3_IO_MASK_10          ((uint32_t)0x00000040) /* PC6 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_C
#undef SCKEY_P3_IO_COMP1_MASK_C
#undef SCKEY_P3_MODER_COMP1_MASK_C
#undef SCKEY_P3_MODER_COMP1_MASK_C_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_C
#if (((SCKEY_P3_MASK&GROUP8)== GROUP8) && ((SCKEY_P1_MASK&GROUP9)== GROUP9))
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00004400)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000011)  /* PC0 and PC4 */
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x00000303)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000101)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0180)
#elif ((SCKEY_P3_MASK&GROUP8)== GROUP8)
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00000400)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000001) /* PC0 */
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x00000003)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000001)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0080)
#elif ((SCKEY_P3_MASK&GROUP9)== GROUP9)
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00004000)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000010) /* PC4 */
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x00000300)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000100)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0100)
#else
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P3_COMP2_MASK_C
#undef SCKEY_P3_IO_COMP2_MASK_C
#undef SCKEY_P3_MODER_COMP2_MASK_C
#undef SCKEY_P3_MODER_COMP2_MASK_C_OUT
#undef SCKEY_P3_STATE_COMP2_MASK_C
#if ((SCKEY_P3_MASK & GROUP10) == GROUP10)
#define SCKEY_P3_COMP2_MASK_C           ((uint32_t)0x00000001)
#define SCKEY_P3_IO_COMP2_MASK_C        ((uint32_t)0x00000040) /* PC6 */
#define SCKEY_P3_MODER_COMP2_MASK_C     ((uint32_t)0x00003000)
#define SCKEY_P3_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00001000)
#define SCKEY_P3_STATE_COMP2_MASK_C     ((uint16_t)0x0200)
#else
#define SCKEY_P3_COMP2_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_C     ((uint16_t)0x0000)
#endif
#endif

#endif
//# PORT_C

