TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
#endif
//# (SCKEY_P3_CH == CH1)

#if (SCKEY_P3_CH == CH2)

#ifdef PORT_A
#define P3_IO_PORT_A     (GPIOA)
#define P3_IO_MASK_1     ((uint32_t)0x00000002)   /* PA1 */
#define P3_IO_MASK_2     ((uint32_t)0x00000080)   /* PA7 */
#define P3_IO_MASK_4     ((uint32_t)0x00000200)   /* PA9 */
#define P3_IO_MASK_5     ((uint32_t)0x00004000)   /* PA14 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_A
#undef SCKEY_P3_IO_COMP1_MASK_A
#undef SCKEY_P3_MODER_COMP1_MASK_A
#undef SCKEY_P3_MODER_COMP1_MASK_A_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_A
#if (((SCKEY_P3_MASK & GROUP1) == GROUP1) && ((SCKEY_P3_MASK & GROUP2)== GROUP2))
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000082)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000082)  /*PA1 and PA7*/
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x0000C00C)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00004004)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0003)
#elif ((SCKEY_P3_MASK & GROUP1)== GROUP1)
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000002)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000002) /* PA1 */
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x0000000C)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000004)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0001)
#elif ((SCKEY_P3_MASK & GROUP2)== GROUP2)
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000080)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000080) /* PA7 */
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x0000C000)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00004000)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0002)
#else
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P3_COMP2_MASK_A
#undef SCKEY_P3_IO_COMP2_MASK_A
#undef SCKEY_P3_MODER_COMP2_MASK_A
#undef SCKEY_P3_MODER_COMP2_MASK_A_OUT
#undef SCKEY_P3_STATE_COMP2_MASK_A
#if (((SCKEY_P3_MASK & GROUP4) == GROUP4) && ((SCKEY_P3_MASK & GROUP5)== GROUP5))
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000480)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00004200) /* PA9 and PA14 */
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0x300C0000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x10040000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint16_t)0x0018)
#elif ((SCKEY_P3_MASK & GROUP4)== GROUP4)
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000400)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00000200) /* PA9 */
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0x000C0000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00040000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint16_t)0x0008)
#elif ((SCKEY_P3_MASK & GROUP5)== GROUP5)
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000080)
#define SCKEY_P3_IO_COMP2_MASK _A       ((uint32_t)0x00004000) /* PA14 */
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0x30000000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x10000000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint32_t)0x0010)
#else
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint16_t)0x0000)
#endif
#endif

#endif
//# PORT_A

#ifdef PORT_B
#define P3_PORT_B              (GPIOB)
#define P3_IO_MASK_3           ((uint32_t)0x00000002)   /* PB1 */
#define P3_IO_MASK_7           ((uint32_t)0x00002000)   /* PB13 */
#define P3_IO_MASK_6           ((uint32_t)0x00000020)   /* PB5 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_B
#undef SCKEY_P3_IO_COMP1_MASK_B
#undef SCKEY_P3_MODER_COMP1_MASK_B
#undef SCKEY_P3_MODER_COMP1_MASK_B_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_B
#if ((((SCKEY_P3_MASK & GROUP3)== GROUP3) && ((SCKEY_P3_MASK & GROUP7)== GROUP7)))
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00080200)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00002002)  /* PB1 and PB13 */
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x0C00000C)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x04000004)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0044)
#elif ((SCKEY_P3_MASK & GROUP3)== GROUP3)
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00000200)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00000002) /* PB1 */
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x0000000C)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000004)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0004)
#elif (SCKEY_P3_MASK & GROUP7)== GROUP7
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00080000)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00002000) /* PB13 */
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x0C000000)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x04000000)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0040)
#else
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P3_COMP2_MASK_B
#undef SCKEY_P3_IO_COMP2_MASK_B
#undef SCKEY_P3_MODER_COMP2_MASK_B
#undef SCKEY_P3_MODER_COMP2_MASK_B_OUT
#undef SCKEY_P3_STATE_COMP2_MASK_B
#if ((SCKEY_P3_MASK & GROUP6)== GROUP6)
#define SCKEY_P3_COMP2_MASK_B           ((uint32_t)0x00000020)
#define SCKEY_P3_IO_COMP2_MASK_B        ((uint32_t)0x00000020) /* PB5 */
#define SCKEY_P3_MODER_COMP2_MASK_B     ((uint32_t)0x00000C00)
#define SCKEY_P3_MODER_COMP2_MASK_B_OUT ((uint32_t)0x00000400)
#define SCKEY_P3_STATE_COMP2_MASK_B     ((uint16_t)0x0020)
#else
#define SCKEY_P3_COMP2_MASK_B           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_B        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_B     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_B     ((uint16_t)0x0000)
#endif
#endif

#endif
//# PORT_B

#ifdef PORT_C
#define P3_PORT_C              (GPIOC)
#define P3_IO_MASK_8           ((uint32_t)0x00000002)   /* PC1 */
#define P3_IO_MASK_9           ((uint32_t)0x00000020)   /* PC5 */
#define P3_IO_MASK_10          ((uint32_t)0x00000080)   /* PC7 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_C
#undef SCKEY_P3_IO_COMP1_MASK_C
#undef SCKEY_P3_MODER_COMP1_MASK_C
#undef SCKEY_P3_MODER_COMP1_MASK_C_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_C
#if (((SCKEY_P3_MASK & GROUP8)== GROUP8) && ((SCKEY_P3_MASK & GROUP9)== GROUP9))
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00008800)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000022)  /* PC1 and PC5 */
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x00000C0C)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000404)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0180)
#elif ((SCKEY_P3_MASK & GROUP8)== GROUP8)
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00000800)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000002) /* PC1 */
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x0000000C)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000004)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0080)
#elif ((SCKEY_P3_MASK & GROUP9)== GROUP9)
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00008000)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000020) /* PC5 */
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x00000C00)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000400)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0100)
#else
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P3_COMP2_MASK_C
#undef SCKEY_P3_IO_COMP2_MASK_C
#undef SCKEY_P3_MODER_COMP2_MASK_C
#undef SCKEY_P3_MODER_COMP2_MASK_C_OUT
#undef SCKEY_P3_STATE_COMP2_MASK_C
#if ((SCKEY_P3_MASK & GROUP10)== GROUP10)
#define SCKEY_P3_COMP2_MASK_C           ((uint32_t)0x00000002)
#define SCKEY_P3_IO_COMP2_MASK_C        ((uint32_t)0x00000080) /* PC7 */
#define SCKEY_P3_MODER_COMP2_MASK_C     ((uint32_t)0x0000C000)
#define SCKEY_P3_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00004000)
#define SCKEY_P3_STATE_COMP2_MASK_C     ((uint16_t)0x0200)
#else
#define SCKEY_P3_COMP2_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_C     ((uint16_t)0x0000)
#endif
#endif
#endif
//# PORT_C

#endif
//# (SCKEY_P3_CH == CH2)

#if (SCKEY_P3_CH == CH3)

#ifdef PORT_A
#define P3_IO_PORT_A  (GPIOA)
#define P3_IO_MASK_1  ((uint32_t)0x00000004)   /* PA2 */
#define P3_IO_MASK_4  ((uint32_t)0x00000400)   /* PA10 */
#define P3_IO_MASK_5  ((uint32_t)0x00008000)   /* PA15 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_A
#undef SCKEY_P3_IO_COMP1_MASK_A
#undef SCKEY_P3_MODER_COMP1_MASK_A
#undef SCKEY_P3_MODER_COMP1_MASK_A_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_A
#if ((SCKEY_P3_MASK & GROUP1)== GROUP1)
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000004)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000004)  /* PA2 */
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x00000030)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000010)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0001)
#else
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P3_COMP2_MASK_A
#undef SCKEY_P3_IO_COMP2_MASK_A
#undef SCKEY_P3_MODER_COMP2_MASK_A
#undef SCKEY_P3_MODER_COMP2_MASK_A_OUT
#undef SCKEY_P3_STATE_COMP2_MASK_A
#if  (((SCKEY_P3_MASK & GROUP4) == GROUP4) &&  ((SCKEY_P3_MASK & GROUP5) == GROUP5))
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000900)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00008400) /* PA10 and PA15 */
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0xC0300000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x40100000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint16_t)0x0018)
#elif ((SCKEY_P3_MASK & GROUP4) == GROUP4)
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000800)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00000400) /* PA10 */
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0x00300000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00100000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint16_t)0x0008)
#elif ((SCKEY_P3_MASK & GROUP5) == GROUP5)
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000100)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00008000) /* PA15 */
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0xC0000000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x40000000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint16_t)0x0010)
#else
#define SCKEY_P3_COMP2_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_A     ((uint16_t)0x0000)
#endif
#endif

#endif
//# PORT_A

#ifdef PORT_B
#define P3_PORT_B     (GPIOB)
#define P3_IO_MASK_7  (0x00004000)   /* PB14 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_B
#undef SCKEY_P3_IO_COMP1_MASK_B
#undef SCKEY_P3_MODER_COMP1_MASK_B
#undef SCKEY_P3_MODER_COMP1_MASK_B_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_B
#if ((SCKEY_P3_MASK & GROUP7)== GROUP7)
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00100000)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00004000)  /* PB14 */
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x30000000)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x10000000)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0040)
#else
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0000)
#endif
#endif

#endif
//# PORT_B

#ifdef PORT_C
#define P3_PORT_C     (GPIOC)
#define P3_IO_MASK_8  ((uint32_t)0x00000004)   /* PC2 */
#define P3_IO_MASK_10 ((uint32_t)0x00000100)  /* PC8 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_C
#undef SCKEY_P3_IO_COMP1_MASK_C
#undef SCKEY_P3_MODER_COMP1_MASK_C
#undef SCKEY_P3_MODER_COMP1_MASK_C_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_C
#if ((SCKEY_P3_MASK & GROUP8) == GROUP8)
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00001000)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000004)  /* PC2 */
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x00000030)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000010)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0080)
#else
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P3_COMP2_MASK_C
#undef SCKEY_P3_IO_COMP2_MASK_C
#undef SCKEY_P3_MODER_COMP2_MASK_C
#undef SCKEY_P3_MODER_COMP2_MASK_C_OUT
#undef SCKEY_P3_STATE_COMP2_MASK_C
#if ((SCKEY_P3_MASK & GROUP10) == GROUP10)
#define SCKEY_P3_COMP2_MASK_C           ((uint32_t)0x00000004)
#define SCKEY_P3_IO_COMP2_MASK_C        ((uint32_t)0x00000100) /* PC8 */
#define SCKEY_P3_MODER_COMP2_MASK_C     ((uint32_t)0x00030000)
#define SCKEY_P3_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00010000)
#define SCKEY_P3_STATE_COMP2_MASK_C     ((uint16_t)0x0200)
#else
#define SCKEY_P3_COMP2_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_C     ((uint16_t)0x0000)
#endif
#endif

#endif
//# PORT_C

#endif
//# (SCKEY_P3_CH == CH3)

