TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
#if (SCKEY_P3_CH == CH4)

#ifdef PORT_A
#define P3_PORT_A     (GPIOA)
#define P3_IO_MASK_1  ((uint32_t)0x00000008)   /* PA3 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_A
#undef SCKEY_P3_IO_COMP1_MASK_A
#undef SCKEY_P3_MODER_COMP1_MASK_A
#undef SCKEY_P3_MODER_COMP1_MASK_A_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_A
#if ((SCKEY_P3_MASK & GROUP1) == GROUP1)
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000008)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000008)  /* PA3 */
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x000000C0)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000040)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0001)
#else
#define SCKEY_P3_COMP1_MASK_A           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_A        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_A     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_A_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_A     ((uint16_t)0x0000)
#endif
#endif
#endif
//# PORT_A

#ifdef PORT_B
#define P3_PORT_B     (GPIOB)
#define P3_IO_MASK_7  ((uint32_t)0x00008000)   /* PB15 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_B
#undef SCKEY_P3_IO_COMP1_MASK_B
#undef SCKEY_P3_MODER_COMP1_MASK_B
#undef SCKEY_P3_MODER_COMP1_MASK_B_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_B
#if ((SCKEY_P3_MASK & GROUP7) == GROUP7)
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00200000)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00008000)  /* PB15 */
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0xC0000000)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x40000000)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0040)
#else
#define SCKEY_P3_COMP1_MASK_B           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_B        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_B     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_B_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_B     ((uint16_t)0x0000)
#endif
#endif
#endif
//# PORT_B

#ifdef PORT_C
#define P3_PORT_C           (GPIOC)
#define P3_IO_MASK_8        ((uint32_t)0x00000008)   /* PC3 */
#define P3_IO_MASK_10       ((uint32_t)0x00000200)  /* PC9 */
/* Only the comparator 1 is used */
#ifdef COMP1
#undef SCKEY_P3_COMP1_MASK_C
#undef SCKEY_P3_IO_COMP1_MASK_C
#undef SCKEY_P3_MODER_COMP1_MASK_C
#undef SCKEY_P3_MODER_COMP1_MASK_C_OUT
#undef SCKEY_P3_STATE_COMP1_MASK_C
#if ((SCKEY_P3_MASK & GROUP8)== GROUP8)
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00002000)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000008)  /* PC3 */
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x000000C0)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000040)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0080)
#else
#define SCKEY_P3_COMP1_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP1_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP1_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP1_MASK_C     ((uint16_t)0x0000)
#endif
#endif
/* Only the comparator 2 is used */
#ifdef COMP2
#undef SCKEY_P3_COMP2_MASK_C
#undef SCKEY_P3_IO_COMP2_MASK_C
#undef SCKEY_P3_MODER_COMP2_MASK_C
#undef SCKEY_P3_MODER_COMP2_MASK_C_OUT
#undef SCKEY_P3_STATE_COMP2_MASK_C
#if ((SCKEY_P3_MASK & GROUP10)== GROUP10)
#define SCKEY_P3_COMP2_MASK_C           ((uint32_t)0x00000008)
#define SCKEY_P3_IO_COMP2_MASK_C        ((uint32_t)0x00000200) /* PC9 */
#define SCKEY_P3_MODER_COMP2_MASK_C     ((uint32_t)0x000C0000)
#define SCKEY_P3_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00040000)
#define SCKEY_P3_STATE_COMP2_MASK_C     ((uint16_t)0x0200)
#else
#define SCKEY_P3_COMP2_MASK_C           ((uint32_t)0x00000000)
#define SCKEY_P3_IO_COMP2_MASK_C        ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_C     ((uint32_t)0x00000000)
#define SCKEY_P3_MODER_COMP2_MASK_C_OUT ((uint32_t)0x00000000)
#define SCKEY_P3_STATE_COMP2_MASK_C     ((uint16_t)0x0000)
#endif
#endif
#endif
//# PORT_C

#endif
//# (SCKEY_P3_CH == CH4)

#endif
//# (NUMBER_OF_SINGLE_CHANNEL_PORTS > 2) || (NUMBER_OF_MULTI_CHANNEL_KEYS > 0)

#define SCKEY_P3_STATE_COMP1_MASK (SCKEY_P3_STATE_COMP1_MASK_A\
                                   |SCKEY_P3_STATE_COMP1_MASK_B\
                                   |SCKEY_P3_STATE_COMP1_MASK_C)

#define SCKEY_P3_STATE_COMP2_MASK (SCKEY_P3_STATE_COMP2_MASK_A\
                                   |SCKEY_P3_STATE_COMP2_MASK_B\
                                   |SCKEY_P3_STATE_COMP2_MASK_C)

#define SCKEY_P3_STATE_MASK (SCKEY_P3_STATE_COMP1_MASK | SCKEY_P3_STATE_COMP2_MASK)

#define P3_MODER_MASK_A_OUT (SCKEY_P3_MODER_COMP1_MASK_A_OUT | SCKEY_P3_MODER_COMP2_MASK_A_OUT | SHIELD_MODER_MASK_A_OUT)
#define P3_MODER_MASK_B_OUT (SCKEY_P3_MODER_COMP1_MASK_B_OUT | SCKEY_P3_MODER_COMP2_MASK_B_OUT | SHIELD_MODER_MASK_A_OUT)
#define P3_MODER_MASK_C_OUT (SCKEY_P3_MODER_COMP1_MASK_C_OUT | SCKEY_P3_MODER_COMP2_MASK_C_OUT | SHIELD_MODER_MASK_A_OUT)


#define P3_MODER_MASK_A (SCKEY_P3_MODER_COMP1_MASK_A | SCKEY_P3_MODER_COMP2_MASK_A | SHIELD_MODER_MASK_A)
#define P3_MODER_MASK_B (SCKEY_P3_MODER_COMP1_MASK_B | SCKEY_P3_MODER_COMP2_MASK_B | SHIELD_MODER_MASK_B)
#define P3_MODER_MASK_C (SCKEY_P3_MODER_COMP1_MASK_C | SCKEY_P3_MODER_COMP2_MASK_C | SHIELD_MODER_MASK_C)

#define P3_COMP1_MASK (SCKEY_P3_COMP1_MASK_A | SCKEY_P3_COMP1_MASK_B | SCKEY_P3_COMP1_MASK_C | SHIELD_COMP1_MASK)
#define P3_COMP2_MASK (SCKEY_P3_COMP2_MASK_A | SCKEY_P3_COMP2_MASK_B | SCKEY_P3_COMP2_MASK_C | SHIELD_COMP2_MASK)

#define P3_IO_MASK_A (SCKEY_P3_IO_COMP1_MASK_A | SCKEY_P3_IO_COMP2_MASK_A | SHIELD_IO_MASK_A)
#define P3_IO_MASK_B (SCKEY_P3_IO_COMP1_MASK_B | SCKEY_P3_IO_COMP2_MASK_B | SHIELD_IO_MASK_B)
#define P3_IO_MASK_C (SCKEY_P3_IO_COMP1_MASK_C | SCKEY_P3_IO_COMP2_MASK_C | SHIELD_IO_MASK_C)


/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
#if SPREAD_SPECTRUM
#if SW_SPREAD_SPECTRUM
__IO uint8_t SpreadCounter;
#else /* !SW_SPREAD_SPECTRUM */
#define HW_SPREAD_FREQ_MIN (0x10-(((SPREAD_COUNTER_MAX-1)>>4)+1))
#define HW_SPREAD_FREQ_MAX (0x10-((SPREAD_COUNTER_MIN-1)>>4))
#endif  //SW_SPREAD_SPECTRUM
//# SW_SPREAD_SPECTRUM
uint32_t Previous_calibration_value;
#endif //SPREAD_SPECTRUM
//# SPREAD_SPECTRUM

