TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
TOUCH_PORT_Info_T sTouchIO;

Info_Channel Channel_P1;
Info_Channel Channel_P2;
Info_Channel Channel_P3;

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/* This table is always defined */

#if (NUMBER_OF_SINGLE_CHANNEL_PORTS > 0) && (SCKEY_P1_KEY_COUNT > 0)
const uint8_t Table_SCKEY_P1[SCKEY_P1_KEY_COUNT] =
  {
#if   (SCKEY_P1_A == GROUP1)
    0x00
#elif (SCKEY_P1_A == GROUP2)
    0x01
#elif (SCKEY_P1_A == GROUP3)
    0x02
#elif (SCKEY_P1_A == GROUP4)
    0x03
#elif (SCKEY_P1_A == GROUP5)
    0x04
#elif (SCKEY_P1_A == GROUP6)
    0x05
#elif (SCKEY_P1_A == GROUP7)
    0x06
#elif (SCKEY_P1_A == GROUP8)
    0x07
#elif (SCKEY_P1_A == GROUP9)
    0x08
#elif (SCKEY_P1_A == GROUP10)
    0x09
#endif

#if SCKEY_P1_KEY_COUNT > 1
#if   (SCKEY_P1_B == GROUP1)
    , 0x00
#elif (SCKEY_P1_B == GROUP2)
    , 0x01
#elif (SCKEY_P1_B == GROUP3)
    , 0x02
#elif (SCKEY_P1_B == GROUP4)
    , 0x03
#elif (SCKEY_P1_B == GROUP5)
    , 0x04
#elif (SCKEY_P1_B == GROUP6)
    , 0x05
#elif (SCKEY_P1_B == GROUP7)
    , 0x06
#elif (SCKEY_P1_B == GROUP8)
    , 0x07
#elif (SCKEY_P1_B == GROUP9)
    , 0x08
#elif (SCKEY_P1_B == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P1_KEY_COUNT > 2
#if   (SCKEY_P1_C == GROUP1)
    , 0x00
#elif (SCKEY_P1_C == GROUP2)
    , 0x01
#elif (SCKEY_P1_C == GROUP3)
    , 0x02
#elif (SCKEY_P1_C == GROUP4)
    , 0x03
#elif (SCKEY_P1_C == GROUP5)
    , 0x04
#elif (SCKEY_P1_C == GROUP6)
    , 0x05
#elif (SCKEY_P1_C == GROUP7)
    , 0x06
#elif (SCKEY_P1_C == GROUP8)
    , 0x07
#elif (SCKEY_P1_C == GROUP9)
    , 0x08
#elif (SCKEY_P1_C == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P1_KEY_COUNT > 3
#if   (SCKEY_P1_D == GROUP1)
    , 0x00
#elif (SCKEY_P1_D == GROUP2)
    , 0x01
#elif (SCKEY_P1_D == GROUP3)
    , 0x02
#elif (SCKEY_P1_D == GROUP4)
    , 0x03
#elif (SCKEY_P1_D == GROUP5)
    , 0x04
#elif (SCKEY_P1_D == GROUP6)
    , 0x05
#elif (SCKEY_P1_D == GROUP7)
    , 0x06
#elif (SCKEY_P1_D == GROUP8)
    , 0x07
#elif (SCKEY_P1_D == GROUP9)
    , 0x08
#elif (SCKEY_P1_D == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P1_KEY_COUNT > 4
#if   (SCKEY_P1_E == GROUP1)
    , 0x00
#elif (SCKEY_P1_E == GROUP2)
    , 0x01
#elif (SCKEY_P1_E == GROUP3)
    , 0x02
#elif (SCKEY_P1_E == GROUP4)
    , 0x03
#elif (SCKEY_P1_E == GROUP5)
    , 0x04
#elif (SCKEY_P1_E == GROUP6)
    , 0x05
#elif (SCKEY_P1_E == GROUP7)
    , 0x06
#elif (SCKEY_P1_E == GROUP8)
    , 0x07
#elif (SCKEY_P1_E == GROUP9)
    , 0x08
#elif (SCKEY_P1_E == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P1_KEY_COUNT > 5
#if   (SCKEY_P1_F == GROUP1)
    , 0x00
#elif (SCKEY_P1_F == GROUP2)
    , 0x01
#elif (SCKEY_P1_F == GROUP3)
    , 0x02
#elif (SCKEY_P1_F == GROUP4)
    , 0x03
#elif (SCKEY_P1_F == GROUP5)
    , 0x04
#elif (SCKEY_P1_F == GROUP6)
    , 0x05
#elif (SCKEY_P1_F == GROUP7)
    , 0x06
#elif (SCKEY_P1_F == GROUP8)
    , 0x07
#elif (SCKEY_P1_F == GROUP9)
    , 0x08
#elif (SCKEY_P1_F == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P1_KEY_COUNT > 6
#if   (SCKEY_P1_G == GROUP1)
    , 0x00
#elif (SCKEY_P1_G == GROUP2)
    , 0x01
#elif (SCKEY_P1_G == GROUP3)
    , 0x02
#elif (SCKEY_P1_G == GROUP4)
    , 0x03
#elif (SCKEY_P1_G == GROUP5)
    , 0x04
#elif (SCKEY_P1_G == GROUP6)
    , 0x05
#elif (SCKEY_P1_G == GROUP7)
    , 0x06
#elif (SCKEY_P1_G == GROUP8)
    , 0x07
#elif (SCKEY_P1_G == GROUP9)
    , 0x08
#elif (SCKEY_P1_G == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P1_KEY_COUNT > 7
#if   (SCKEY_P1_H == GROUP1)
    , 0x00
#elif (SCKEY_P1_H == GROUP2)
    , 0x01
#elif (SCKEY_P1_H == GROUP3)
    , 0x02
#elif (SCKEY_P1_H == GROUP4)
    , 0x03
#elif (SCKEY_P1_H == GROUP5)
    , 0x04
#elif (SCKEY_P1_H == GROUP6)
    , 0x05
#elif (SCKEY_P1_H == GROUP7)
    , 0x06
#elif (SCKEY_P1_H == GROUP8)
    , 0x07
#elif (SCKEY_P1_H == GROUP9)
    , 0x08
#elif (SCKEY_P1_H == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P1_KEY_COUNT > 8
#if   (SCKEY_P1_I == GROUP1)
    , 0x00
#elif (SCKEY_P1_I == GROUP2)
    , 0x01
#elif (SCKEY_P1_I == GROUP3)
    , 0x02
#elif (SCKEY_P1_I == GROUP4)
    , 0x03
#elif (SCKEY_P1_I == GROUP5)
    , 0x04
#elif (SCKEY_P1_I == GROUP6)
    , 0x05
#elif (SCKEY_P1_I == GROUP7)
    , 0x06
#elif (SCKEY_P1_I == GROUP8)
    , 0x07
#elif (SCKEY_P1_I == GROUP9)
    , 0x08
#elif (SCKEY_P1_I == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P1_KEY_COUNT > 9
#if   (SCKEY_P1_J == GROUP1)
    , 0x00
#elif (SCKEY_P1_J == GROUP2)
    , 0x01
#elif (SCKEY_P1_J == GROUP3)
    , 0x02
#elif (SCKEY_P1_J== GROUP4)
    , 0x03
#elif (SCKEY_P1_J == GROUP5)
    , 0x04
#elif (SCKEY_P1_J == GROUP6)
    , 0x05
#elif (SCKEY_P1_J == GROUP7)
    , 0x06
#elif (SCKEY_P1_J == GROUP8)
    , 0x07
#elif (SCKEY_P1_J == GROUP9)
    , 0x08
#elif (SCKEY_P1_J == GROUP10)
    , 0x09
#endif
#endif
  };
#endif
//# NUMBER_OF_SINGLE_CHANNEL_PORTS > 0

#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 1
const uint8_t Table_SCKEY_P2[SCKEY_P2_KEY_COUNT] =
  {
#if   (SCKEY_P2_A == GROUP1)
    0x00
#elif (SCKEY_P2_A == GROUP2)
    0x01
#elif (SCKEY_P2_A == GROUP3)
    0x02
#elif (SCKEY_P2_A == GROUP4)
    0x03
#elif (SCKEY_P2_A == GROUP5)
    0x04
#elif (SCKEY_P2_A == GROUP6)
    0x05
#elif (SCKEY_P2_A == GROUP7)
    0x06
#elif (SCKEY_P2_A == GROUP8)
    0x07
#elif (SCKEY_P2_A == GROUP9)
    0x08
#elif (SCKEY_P2_A == GROUP10)
    0x09
#endif

#if SCKEY_P2_KEY_COUNT > 1
#if   (SCKEY_P2_B == GROUP1)
    , 0x00
#elif (SCKEY_P2_B == GROUP2)
    , 0x01
#elif (SCKEY_P2_B == GROUP3)
    , 0x02
#elif (SCKEY_P2_B == GROUP4)
    , 0x03
#elif (SCKEY_P2_B == GROUP5)
    , 0x04
#elif (SCKEY_P2_B == GROUP6)
    , 0x05
#elif (SCKEY_P2_B == GROUP7)
    , 0x06
#elif (SCKEY_P2_B == GROUP8)
    , 0x07
#elif (SCKEY_P2_B == GROUP9)
    , 0x08
#elif (SCKEY_P2_B == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P2_KEY_COUNT > 2
#if   (SCKEY_P2_C == GROUP1)
    , 0x00
#elif (SCKEY_P2_C == GROUP2)
    , 0x01
#elif (SCKEY_P2_C == GROUP3)
    , 0x02
#elif (SCKEY_P2_C == GROUP4)
    , 0x03
#elif (SCKEY_P2_C == GROUP5)
    , 0x04
#elif (SCKEY_P2_C == GROUP6)
    , 0x05
#elif (SCKEY_P2_C == GROUP7)
    , 0x06
#elif (SCKEY_P2_C == GROUP8)
    , 0x07
#elif (SCKEY_P2_C == GROUP9)
    , 0x08
#elif (SCKEY_P2_C == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P2_KEY_COUNT > 3
#if   (SCKEY_P2_D == GROUP1)
    , 0x00
#elif (SCKEY_P2_D == GROUP2)
    , 0x01
#elif (SCKEY_P2_D == GROUP3)
    , 0x02
#elif (SCKEY_P2_D == GROUP4)
    , 0x03
#elif (SCKEY_P2_D == GROUP5)
    , 0x04
#elif (SCKEY_P2_D == GROUP6)
    , 0x05
#elif (SCKEY_P2_D == GROUP7)
    , 0x06
#elif (SCKEY_P2_D == GROUP8)
    , 0x07
#elif (SCKEY_P2_D == GROUP9)
    , 0x08
#elif (SCKEY_P2_D == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P2_KEY_COUNT > 4
#if   (SCKEY_P2_E == GROUP1)
    , 0x00
#elif (SCKEY_P2_E == GROUP2)
    , 0x01
#elif (SCKEY_P2_E == GROUP3)
    , 0x02
#elif (SCKEY_P2_E == GROUP4)
    , 0x03
#elif (SCKEY_P2_E == GROUP5)
    , 0x04
#elif (SCKEY_P2_E == GROUP6)
    , 0x05
#elif (SCKEY_P2_E == GROUP7)
    , 0x06
#elif (SCKEY_P2_E == GROUP8)
    , 0x07
#elif (SCKEY_P2_E == GROUP9)
    , 0x08
#elif (SCKEY_P2_E == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P2_KEY_COUNT > 5
#if   (SCKEY_P2_F == GROUP1)
    , 0x00
#elif (SCKEY_P2_F == GROUP2)
    , 0x01
#elif (SCKEY_P2_F == GROUP3)
    , 0x02
#elif (SCKEY_P2_F == GROUP4)
    , 0x03
#elif (SCKEY_P2_F == GROUP5)
    , 0x04
#elif (SCKEY_P2_F == GROUP6)
    , 0x05
#elif (SCKEY_P2_F == GROUP7)
    , 0x06
#elif (SCKEY_P2_F == GROUP8)
    , 0x07
#elif (SCKEY_P2_F == GROUP9)
    , 0x08
#elif (SCKEY_P2_F == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P2_KEY_COUNT > 6
#if   (SCKEY_P2_G == GROUP1)
    , 0x00
#elif (SCKEY_P2_G == GROUP2)
    , 0x01
#elif (SCKEY_P2_G == GROUP3)
    , 0x02
#elif (SCKEY_P2_G == GROUP4)
    , 0x03
#elif (SCKEY_P2_G == GROUP5)
    , 0x04
#elif (SCKEY_P2_G == GROUP6)
    , 0x05
#elif (SCKEY_P2_G == GROUP7)
    , 0x06
#elif (SCKEY_P2_G == GROUP8)
    , 0x07
#elif (SCKEY_P2_G == GROUP9)
    , 0x08
#elif (SCKEY_P2_G == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P2_KEY_COUNT > 7
#if   (SCKEY_P2_H == GROUP1)
    , 0x00
#elif (SCKEY_P2_H == GROUP2)
    , 0x01
#elif (SCKEY_P2_H == GROUP3)
    , 0x02
#elif (SCKEY_P2_H == GROUP4)
    , 0x03
#elif (SCKEY_P2_H == GROUP5)
    , 0x04
#elif (SCKEY_P2_H == GROUP6)
    , 0x05
#elif (SCKEY_P2_H == GROUP7)
    , 0x06
#elif (SCKEY_P2_H == GROUP8)
    , 0x07
#elif (SCKEY_P2_H == GROUP9)
    , 0x08
#elif (SCKEY_P2_H == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P2_KEY_COUNT > 8
#if   (SCKEY_P2_I == GROUP1)
    , 0x00
#elif (SCKEY_P2_I == GROUP2)
    , 0x01
#elif (SCKEY_P2_I == GROUP3)
    , 0x02
#elif (SCKEY_P2_I == GROUP4)
    , 0x03
#elif (SCKEY_P2_I == GROUP5)
    , 0x04
#elif (SCKEY_P2_I == GROUP6)
    , 0x05
#elif (SCKEY_P2_I == GROUP7)
    , 0x06
#elif (SCKEY_P2_I == GROUP8)
    , 0x07
#elif (SCKEY_P2_I == GROUP9)
    , 0x08
#elif (SCKEY_P2_I == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P2_KEY_COUNT > 9
#if   (SCKEY_P2_J == GROUP1)
    , 0x00
#elif (SCKEY_P2_J == GROUP2)
    , 0x01
#elif (SCKEY_P2_J == GROUP3)
    , 0x02
#elif (SCKEY_P2_J == GROUP4)
    , 0x03
#elif (SCKEY_P2_J == GROUP5)
    , 0x04
#elif (SCKEY_P2_J == GROUP6)
    , 0x05
#elif (SCKEY_P2_J == GROUP7)
    , 0x06
#elif (SCKEY_P2_J == GROUP8)
    , 0x07
#elif (SCKEY_P2_J == GROUP9)
    , 0x08
#elif (SCKEY_P2_J == GROUP10)
    , 0x09
#endif
#endif
  };
#endif
//# NUMBER_OF_SINGLE_CHANNEL_PORTS > 1

