TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 2

const uint8_t Table_SCKEY_P3[SCKEY_P3_KEY_COUNT] =
  {
#if   (SCKEY_P3_A == GROUP1)
    0x00
#elif (SCKEY_P3_A == GROUP2)
    0x01
#elif (SCKEY_P3_A == GROUP3)
    0x02
#elif (SCKEY_P3_A == GROUP4)
    0x03
#elif (SCKEY_P3_A == GROUP5)
    0x04
#elif (SCKEY_P3_A == GROUP6)
    0x05
#elif (SCKEY_P3_A == GROUP7)
    0x06
#elif (SCKEY_P3_A == GROUP8)
    0x07
#elif (SCKEY_P3_A == GROUP9)
    0x08
#elif (SCKEY_P3_A == GROUP10)
    0x09
#endif

#if SCKEY_P3_KEY_COUNT > 1
#if   (SCKEY_P3_B == GROUP1)
    , 0x00
#elif (SCKEY_P3_B == GROUP2)
    , 0x01
#elif (SCKEY_P3_B == GROUP3)
    , 0x02
#elif (SCKEY_P3_B == GROUP4)
    , 0x03
#elif (SCKEY_P3_B == GROUP5)
    , 0x04
#elif (SCKEY_P3_B == GROUP6)
    , 0x05
#elif (SCKEY_P3_B == GROUP7)
    , 0x06
#elif (SCKEY_P3_B == GROUP8)
    , 0x07
#elif (SCKEY_P3_B == GROUP9)
    , 0x08
#elif (SCKEY_P3_B == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 2
#if   (SCKEY_P3_C == GROUP1)
    , 0x00
#elif (SCKEY_P3_C == GROUP2)
    , 0x01
#elif (SCKEY_P3_C == GROUP3)
    , 0x02
#elif (SCKEY_P3_C == GROUP4)
    , 0x03
#elif (SCKEY_P3_C == GROUP5)
    , 0x04
#elif (SCKEY_P3_C == GROUP6)
    , 0x05
#elif (SCKEY_P3_C == GROUP7)
    , 0x06
#elif (SCKEY_P3_C == GROUP8)
    , 0x07
#elif (SCKEY_P3_C == GROUP9)
    , 0x08
#elif (SCKEY_P3_C == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 3
#if   (SCKEY_P3_D == GROUP1)
    , 0x00
#elif (SCKEY_P3_D == GROUP2)
    , 0x01
#elif (SCKEY_P3_D == GROUP3)
    , 0x02
#elif (SCKEY_P3_D == GROUP4)
    , 0x03
#elif (SCKEY_P3_D == GROUP5)
    , 0x04
#elif (SCKEY_P3_D == GROUP6)
    , 0x05
#elif (SCKEY_P3_D == GROUP7)
    , 0x06
#elif (SCKEY_P3_D == GROUP8)
    , 0x07
#elif (SCKEY_P3_D == GROUP9)
    , 0x08
#elif (SCKEY_P3_D == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 4
#if   (SCKEY_P3_E == GROUP1)
    , 0x00
#elif (SCKEY_P3_E == GROUP2)
    , 0x01
#elif (SCKEY_P3_E == GROUP3)
    , 0x02
#elif (SCKEY_P3_E == GROUP4)
    , 0x03
#elif (SCKEY_P3_E == GROUP5)
    , 0x04
#elif (SCKEY_P3_E == GROUP6)
    , 0x05
#elif (SCKEY_P3_E == GROUP7)
    , 0x06
#elif (SCKEY_P3_E == GROUP8)
    , 0x07
#elif (SCKEY_P3_E == GROUP9)
    , 0x08
#elif (SCKEY_P3_E == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 5
#if   (SCKEY_P3_F == GROUP1)
    , 0x00
#elif (SCKEY_P3_F == GROUP2)
    , 0x01
#elif (SCKEY_P3_F == GROUP3)
    , 0x02
#elif (SCKEY_P3_F == GROUP4)
    , 0x03
#elif (SCKEY_P3_F == GROUP5)
    , 0x04
#elif (SCKEY_P3_F == GROUP6)
    , 0x05
#elif (SCKEY_P3_F == GROUP7)
    , 0x06
#elif (SCKEY_P3_F == GROUP8)
    , 0x07
#elif (SCKEY_P3_F == GROUP9)
    , 0x08
#elif (SCKEY_P3_F == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 6
#if   (SCKEY_P3_G == GROUP1)
    , 0x00
#elif (SCKEY_P3_G == GROUP2)
    , 0x01
#elif (SCKEY_P3_G == GROUP3)
    , 0x02
#elif (SCKEY_P3_G == GROUP4)
    , 0x03
#elif (SCKEY_P3_G == GROUP5)
    , 0x04
#elif (SCKEY_P3_G == GROUP6)
    , 0x05
#elif (SCKEY_P3_G == GROUP7)
    , 0x06
#elif (SCKEY_P3_G == GROUP8)
    , 0x07
#elif (SCKEY_P3_G == GROUP9)
    , 0x08
#elif (SCKEY_P3_G == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 7
#if   (SCKEY_P3_H == GROUP1)
    , 0x00
#elif (SCKEY_P3_H == GROUP2)
    , 0x01
#elif (SCKEY_P3_H == GROUP3)
    , 0x02
#elif (SCKEY_P3_H == GROUP4)
    , 0x03
#elif (SCKEY_P3_H == GROUP5)
    , 0x04
#elif (SCKEY_P3_H == GROUP6)
    , 0x05
#elif (SCKEY_P3_H == GROUP7)
    , 0x06
#elif (SCKEY_P3_H == GROUP8)
    , 0x07
#elif (SCKEY_P3_H == GROUP9)
    , 0x08
#elif (SCKEY_P3_H == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 8
#if   (SCKEY_P3_I == GROUP1)
    , 0x00
#elif (SCKEY_P3_I == GROUP2)
    , 0x01
#elif (SCKEY_P3_I == GROUP3)
    , 0x02
#elif (SCKEY_P3_I == GROUP4)
    , 0x03
#elif (SCKEY_P3_I == GROUP5)
    , 0x04
#elif (SCKEY_P3_I == GROUP6)
    , 0x05
#elif (SCKEY_P3_I == GROUP7)
    , 0x06
#elif (SCKEY_P3_I == GROUP8)
    , 0x07
#elif (SCKEY_P3_I == GROUP9)
    , 0x08
#elif (SCKEY_P3_I == GROUP10)
    , 0x09
#endif
#endif
#if SCKEY_P3_KEY_COUNT > 9
#if   (SCKEY_P3_J == GROUP1)
    , 0x00
#elif (SCKEY_P3_J == GROUP2)
    , 0x01
#elif (SCKEY_P3_J == GROUP3)
    , 0x02
#elif (SCKEY_P3_J == GROUP4)
    , 0x03
#elif (SCKEY_P3_J == GROUP5)
    , 0x04
#elif (SCKEY_P3_J == GROUP6)
    , 0x05
#elif (SCKEY_P3_J == GROUP7)
    , 0x06
#elif (SCKEY_P3_J == GROUP8)
    , 0x07
#elif (SCKEY_P3_J == GROUP9)
    , 0x08
#elif (SCKEY_P3_J == GROUP10)
    , 0x09
#endif
#endif
  };
#endif
//# NUMBER_OF_SINGLE_CHANNEL_PORTS > 2

/* Table_SCKEY_BITS contents the individual masks for the port acquisitions */

#if NUMBER_OF_SINGLE_CHANNEL_KEYS > 0
const uint16_t Table_SCKEY_BITS[
  SCKEY_P1_KEY_COUNT
#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 1
  + SCKEY_P2_KEY_COUNT
#endif
#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 2
  + SCKEY_P3_KEY_COUNT
#endif
] =
  {
    SCKEY_P1_A /* Always defined */
#if SCKEY_P1_KEY_COUNT > 1
    , SCKEY_P1_B
#endif
#if SCKEY_P1_KEY_COUNT > 2
    , SCKEY_P1_C
#endif
#if SCKEY_P1_KEY_COUNT > 3
    , SCKEY_P1_D
#endif
#if SCKEY_P1_KEY_COUNT > 4
    , SCKEY_P1_E
#endif
#if SCKEY_P1_KEY_COUNT > 5
    , SCKEY_P1_F
#endif
#if SCKEY_P1_KEY_COUNT > 6
    , SCKEY_P1_G
#endif
#if SCKEY_P1_KEY_COUNT > 7
    , SCKEY_P1_H
#endif
#if SCKEY_P1_KEY_COUNT > 8
    , SCKEY_P1_I
#endif
#if SCKEY_P1_KEY_COUNT > 9
    , SCKEY_P1_J
#endif

#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 1
    , SCKEY_P2_A
#if SCKEY_P2_KEY_COUNT > 1
    , SCKEY_P2_B
#endif
#if SCKEY_P2_KEY_COUNT > 2
    , SCKEY_P2_C
#endif
#if SCKEY_P2_KEY_COUNT > 3
    , SCKEY_P2_D
#endif
#if SCKEY_P2_KEY_COUNT > 4
    , SCKEY_P2_E
#endif
#if SCKEY_P2_KEY_COUNT > 5
    , SCKEY_P2_F
#endif
#if SCKEY_P2_KEY_COUNT > 6
    , SCKEY_P2_G
#endif
#if SCKEY_P2_KEY_COUNT > 7
    , SCKEY_P2_H
#endif
#if SCKEY_P2_KEY_COUNT > 8
    , SCKEY_P2_I
#endif
#if SCKEY_P2_KEY_COUNT > 9
    , SCKEY_P2_J
#endif
#endif

