TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
#if NUMBER_OF_SINGLE_CHANNEL_PORTS > 2
    , SCKEY_P3_A
#if SCKEY_P3_KEY_COUNT > 1
    , SCKEY_P3_B
#endif
#if SCKEY_P3_KEY_COUNT > 2
    , SCKEY_P3_C
#endif
#if SCKEY_P3_KEY_COUNT > 3
    , SCKEY_P3_D
#endif
#if SCKEY_P3_KEY_COUNT > 4
    , SCKEY_P3_E
#endif
#if SCKEY_P3_KEY_COUNT > 5
    , SCKEY_P3_F
#endif
#if SCKEY_P3_KEY_COUNT > 6
    , SCKEY_P3_G
#endif
#if SCKEY_P3_KEY_COUNT > 7
    , SCKEY_P3_H
#endif
#if SCKEY_P3_KEY_COUNT > 8
    , SCKEY_P3_I
#endif
#if SCKEY_P3_KEY_COUNT > 9
    , SCKEY_P3_J
#endif
#endif
  };
#endif
//# NUMBER_OF_SINGLE_CHANNEL_KEYS > 0

#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0
const uint16_t Table_MCKEY_PORTS[
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 1
  CHANNEL_PER_MCKEY
#endif
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 2
  CHANNEL_PER_MCKEY + CHANNEL_PER_MCKEY
#endif
] =
  {
    MCKEY1_A_CH,
    MCKEY1_B_CH,
    MCKEY1_C_CH
#if NUMBER_OF_MULTI_CHANNEL_KEYS > 1
    , MCKEY2_A_CH
    , MCKEY2_B_CH
    , MCKEY2_C_CH
#endif
  };
#endif
//# NUMBER_OF_MULTI_CHANNEL_KEYS > 0

#if NUMBER_OF_MULTI_CHANNEL_KEYS > 0
const  uint16_t Table_MCKEY_BITS[
#if NUMBER_OF_MULTI_CHANNEL_KEYS == 1
  CHANNEL_PER_MCKEY
#elif NUMBER_OF_MULTI_CHANNEL_KEYS == 2
  CHANNEL_PER_MCKEY + CHANNEL_PER_MCKEY
#endif
] =
  {
    MCKEY1_A,
    MCKEY1_B,
    MCKEY1_C
#if NUMBER_OF_MULTI_CHANNEL_KEYS > 1
    , MCKEY2_A
    , MCKEY2_B
    , MCKEY2_C
#endif
  };
#endif
//# NUMBER_OF_MULTI_CHANNEL_KEYS > 0


#if defined ( __CC_ARM ) || defined( __GNUC__ )// KEIL & GNU
__INLINE void __TSL_wait_CLWHTA(void)
#elif defined ( __ICCARM__ ) // IAR
#pragma inline=forced
void __TSL_wait_CLWHTA(void)
#endif
{
#if CLWHTA > 0
  TSL_NOP
#endif
#if CLWHTA > 1
  TSL_NOP
#endif
#if CLWHTA > 2
  TSL_NOP
#endif
#if CLWHTA > 3
  TSL_NOP
#endif
#if CLWHTA > 4
  TSL_NOP
#endif
#if CLWHTA > 5
  TSL_NOP
#endif
#if CLWHTA > 6
  TSL_NOP
#endif
#if CLWHTA > 7
  TSL_NOP
#endif
#if CLWHTA > 8
  TSL_NOP
#endif
#if CLWHTA > 9
  TSL_NOP
#endif
#if CLWHTA > 10
  TSL_NOP
#endif
#if CLWHTA > 11
  TSL_NOP
#endif
#if CLWHTA > 12
  TSL_NOP
#endif
#if CLWHTA > 13
  TSL_NOP
#endif
#if CLWHTA > 14
  TSL_NOP
#endif
#if CLWHTA > 15
  TSL_NOP
#endif
#if CLWHTA > 16
  TSL_NOP
#endif
#if CLWHTA > 17
  TSL_NOP
#endif
#if CLWHTA > 18
  TSL_NOP
#endif
#if CLWHTA > 19
  TSL_NOP
#endif
#if CLWHTA > 20
  TSL_NOP
#endif
#if CLWHTA > 21
  TSL_NOP
#endif
#if CLWHTA > 22
  TSL_NOP
#endif
#if CLWHTA > 23
  TSL_NOP
#endif
#if CLWHTA > 24
  TSL_NOP
#endif
#if CLWHTA > 25
  TSL_NOP
#endif
#if CLWHTA > 26
  TSL_NOP
#endif
#if CLWHTA > 27
  TSL_NOP
#endif
#if CLWHTA > 28
  TSL_NOP
#endif
#if CLWHTA > 29
  TSL_NOP
#endif
#if CLWHTA > 30
  TSL_NOP
#endif
#if CLWHTA > 31
  TSL_NOP
#endif
#if CLWHTA > 32
  TSL_NOP
#endif
#if CLWHTA > 33
  TSL_NOP
#endif
#if CLWHTA > 34
  TSL_NOP
#endif
#if CLWHTA > 35
  TSL_NOP
#endif
#if CLWHTA > 36
  TSL_NOP
#endif
#if CLWHTA > 37
  TSL_NOP
#endif
#if CLWHTA > 38
  TSL_NOP
#endif
#if CLWHTA > 39
  TSL_NOP
#endif
#if CLWHTA > 40
  TSL_NOP
#endif
#if CLWHTA > 41
  TSL_NOP
#endif
#if CLWHTA > 42
  TSL_NOP
#endif
#if CLWHTA > 43
  TSL_NOP
#endif
#if CLWHTA > 44
  TSL_NOP
#endif
#if CLWHTA > 45
  TSL_NOP
#endif
#if CLWHTA > 46
  TSL_NOP
#endif
#if CLWHTA > 47
  TSL_NOP
#endif
#if CLWHTA > 48
  TSL_NOP
#endif
#if CLWHTA > 49
  TSL_NOP
#endif
}


#if defined ( __CC_ARM )  || defined( __GNUC__ )// KEIL
__INLINE void __TSL_wait_CLWLTA(void)
#elif defined ( __ICCARM__ ) // IAR
#pragma inline=forced
void __TSL_wait_CLWLTA(void)
#endif
{
#if CLWLTA > 0
  TSL_NOP
#endif
#if CLWLTA > 1
  TSL_NOP
#endif
#if CLWLTA > 2
  TSL_NOP
#endif
#if CLWLTA > 3
  TSL_NOP
#endif
#if CLWLTA > 4
  TSL_NOP
#endif
#if CLWLTA > 5
  TSL_NOP
#endif
#if CLWLTA > 6
  TSL_NOP
#endif
#if CLWLTA > 7
  TSL_NOP
#endif
#if CLWLTA > 8
  TSL_NOP
#endif
#if CLWLTA > 9
  TSL_NOP
#endif
#if CLWLTA > 10
  TSL_NOP
#endif
#if CLWLTA > 11
  TSL_NOP
#endif
#if CLWLTA > 12
  TSL_NOP
#endif
#if CLWLTA > 13
  TSL_NOP
#endif
#if CLWLTA > 14
  TSL_NOP
#endif
#if CLWLTA > 15
  TSL_NOP
#endif
#if CLWLTA > 16
  TSL_NOP
#endif
#if CLWLTA > 17
  TSL_NOP
#endif
#if CLWLTA > 18
  TSL_NOP
#endif
#if CLWLTA > 19
  TSL_NOP
#endif
#if CLWLTA > 20
  TSL_NOP
#endif
#if CLWLTA > 21
  TSL_NOP
#endif
#if CLWLTA > 22
  TSL_NOP
#endif
#if CLWLTA > 23
  TSL_NOP
#endif
#if CLWLTA > 24
  TSL_NOP
#endif
#if CLWLTA > 25
  TSL_NOP
#endif
#if CLWLTA > 26
  TSL_NOP
#endif
#if CLWLTA > 27
  TSL_NOP
#endif
#if CLWLTA > 28
  TSL_NOP
#endif
#if CLWLTA > 29
  TSL_NOP
#endif
#if CLWLTA > 30
  TSL_NOP
#endif
#if CLWLTA > 31
  TSL_NOP
#endif
#if CLWLTA > 32
  TSL_NOP
#endif
#if CLWLTA > 33
  TSL_NOP
#endif
#if CLWLTA > 34
  TSL_NOP
#endif
#if CLWLTA > 35
  TSL_NOP
#endif
#if CLWLTA > 36
  TSL_NOP
#endif
#if CLWLTA > 37
  TSL_NOP
#endif
#if CLWLTA > 38
  TSL_NOP
#endif
#if CLWLTA > 39
  TSL_NOP
#endif
#if CLWLTA > 40
  TSL_NOP
#endif
#if CLWLTA > 41
  TSL_NOP
#endif
#if CLWLTA > 42
  TSL_NOP
#endif
#if CLWLTA > 43
  TSL_NOP
#endif
#if CLWLTA > 44
  TSL_NOP
#endif
#if CLWLTA > 45
  TSL_NOP
#endif
#if CLWLTA > 46
  TSL_NOP
#endif
#if CLWLTA > 47
  TSL_NOP
#endif
#if CLWLTA > 48
  TSL_NOP
#endif
#if CLWLTA > 49
  TSL_NOP
#endif
}


#if (SPREAD_SPECTRUM > 0) && (SW_SPREAD_SPECTRUM > 0)

/**
  ******************************************************************************
  * @brief Spread Spectrum waiting routine. A variable delay is
  * inserted between each step.
  * @param None
  * @retval None
  ******************************************************************************
  */
#if (USE_INLINED_FUNCTIONS != 0)
__INLINE void TSL_SW_Spread_Spectrum(void)
#else
void TSL_SW_Spread_Spectrum(void)
#endif
{
  uint8_t i;

  SpreadCounter++;

  if (SpreadCounter == SPREAD_COUNTER_MAX)
  {
    SpreadCounter = SPREAD_COUNTER_MIN;
  }
  i = SpreadCounter;
  while (--i);

