TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
}

#endif
//# (SPREAD_SPECTRUM > 0) && (SW_SPREAD_SPECTRUM > 0)

/**
  ******************************************************************************
  * @brief Init for I/Os used in the application. Used for SW I/O toggling.
  * If the hardware cell is used, the responsability of the I/O configuration is
  * given to the user layer.
  * @param None
  * @retval None
  ******************************************************************************
  */
void TSL_IO_Init(void)
{

#ifdef PORT_A
  /* Enables GPIOA clock */
  RCC->AHBENR |= RCC_AHBPeriph_GPIOA ;
  /* Disables Hysteresis Register */
  RI->HYSCR1 |= (uint32_t)(SAMP_CAP_IO_MASK_A) | (uint32_t)(P1_IO_MASK_A) | (uint32_t)(P2_IO_MASK_A) | (uint32_t)(P3_IO_MASK_A);
#endif
#ifdef PORT_B
  /* Enables GIOB clock */
  RCC->AHBENR |= RCC_AHBPeriph_GPIOB;
  /* Disables Hysteresis Register */
  RI->HYSCR1 |= (uint32_t)(((uint32_t)(SAMP_CAP_IO_MASK_B) | (uint32_t)(P1_IO_MASK_B) | (uint32_t)(P2_IO_MASK_B) | (uint32_t)(P3_IO_MASK_B)) << 16);
#endif
#ifdef PORT_C
  /* Enables GPIOC clock */
  RCC->AHBENR |= RCC_AHBPeriph_GPIOC ;
  /* Disables Hysteresis Register */
  RI->HYSCR2 |= (uint32_t)(SAMP_CAP_IO_MASK_C) | (uint32_t)(P1_IO_MASK_C) | (uint32_t)(P2_IO_MASK_C) | (uint32_t)(P3_IO_MASK_C);
#endif

  /* Enables the comparator interface clock */
  RCC->APB1ENR |= RCC_APB1Periph_COMP;

  /* Enable RI Switch */
  RI->ASCR1 &= (uint32_t)(~0x80000000); // ADC analog switches open !!!

#ifdef PORT_A
  GPIOA->OTYPER &= (uint16_t)(~SAMP_CAP_IO_MASK_A) | (uint16_t)(~P1_IO_MASK_A);  /* Output push pull config */
  GPIOA->PUPDR &= (uint32_t)(~P1_MODER_MASK_A) | (uint32_t)(~SAMP_CAP_MODER_MASK_A);
#endif
#ifdef PORT_B
  GPIOB->OTYPER &= (uint16_t)(~SAMP_CAP_IO_MASK_B) | (uint16_t)(~P1_IO_MASK_B);  /* Output push pull config */
  GPIOB->PUPDR &= (uint32_t)(~P1_MODER_MASK_B) | (uint32_t)(~SAMP_CAP_MODER_MASK_B);
#endif
#ifdef PORT_C
  GPIOC->OTYPER &= (uint16_t)(~SAMP_CAP_IO_MASK_C) | (uint16_t)(~P1_IO_MASK_C);  /* Output push pull config */
  GPIOC->PUPDR &= (uint32_t)(~P1_MODER_MASK_C) | (uint32_t)(~SAMP_CAP_MODER_MASK_C);
#endif

#if (NUMBER_OF_SINGLE_CHANNEL_PORTS > 1)
#ifdef PORT_A
  GPIOA->OTYPER &= (uint16_t)(~SAMP_CAP_IO_MASK_A) | (uint16_t)(~P2_IO_MASK_A);  /* Output push pull config */
  GPIOA->PUPDR &= (uint32_t)(~P2_MODER_MASK_A) | (uint32_t)(~SAMP_CAP_MODER_MASK_A);

#endif
#ifdef PORT_B
  GPIOB->OTYPER &= (uint16_t)(~SAMP_CAP_IO_MASK_B) | (uint16_t)(~P2_IO_MASK_B);  /* Output push pull config */
  GPIOB->PUPDR &= (uint32_t)(~P2_MODER_MASK_B) | (uint32_t)(~SAMP_CAP_MODER_MASK_B);
#endif
#ifdef PORT_C
  GPIOC->OTYPER &= (uint16_t)(~SAMP_CAP_IO_MASK_C) | (uint16_t)(~P2_IO_MASK_C);  /* Output push pull config */
  GPIOC->PUPDR &= (uint32_t)(~P2_MODER_MASK_C) | (uint32_t)(~SAMP_CAP_MODER_MASK_C);
#endif

#endif

#if (NUMBER_OF_SINGLE_CHANNEL_PORTS > 2)
#ifdef PORT_A
  GPIOA->OTYPER &= (uint16_t)(~SAMP_CAP_IO_MASK_A) | (uint16_t)(~P3_IO_MASK_A);  /* Output push pull config */
  GPIOA->PUPDR &= (uint32_t)(~P3_MODER_MASK_A) | (uint32_t)(~SAMP_CAP_MODER_MASK_A);

#endif
#ifdef PORT_B
  GPIOB->OTYPER &= (uint16_t)(~SAMP_CAP_IO_MASK_B) | (uint16_t)(~P3_IO_MASK_B);  /* Output push pull config */
  GPIOB->PUPDR &= (uint32_t)(~P3_MODER_MASK_B) | (uint32_t)(~SAMP_CAP_MODER_MASK_B);
#endif
#ifdef PORT_C
  GPIOC->OTYPER &= (uint16_t)(~SAMP_CAP_IO_MASK_C) | (uint16_t)(~P3_IO_MASK_C);  /* Output push pull config */
  GPIOC->PUPDR &= (uint32_t)(~P3_MODER_MASK_C) | (uint32_t)(~SAMP_CAP_MODER_MASK_C);
#endif

#endif

  TSL_IO_Clamp();

}


/**
  ******************************************************************************
  * @brief Put All Sensing I/Os in ouput mode at 0.
  * @param None
  * @retval None
  ******************************************************************************
  */
void TSL_IO_Clamp(void)
{
  /* Open the analog switches */
#ifdef COMP1
  RI->ASCR1 &= (uint32_t)(~(SAMP_CAP_COMP1_MASK | P1_COMP1_MASK));
#endif
#ifdef COMP2
  RI->ASCR2 &= (uint32_t)(~(SAMP_CAP_COMP2_MASK | P1_COMP2_MASK));
#endif

  /* Discharging sampling capacitor */

#if (PROTECT_IO_ACCESS > 0)
  disableInterrupts();
#endif

#ifdef PORT_A
  GPIOA->ODR &= (uint16_t)(~SAMP_CAP_IO_MASK_A);
  GPIOA->MODER = (uint32_t)((GPIOA->MODER & ~(SAMP_CAP_MODER_MASK_A)) | SAMP_CAP_MODER_MASK_A_OUT);
#endif
#ifdef PORT_B
  GPIOB->ODR &= (uint16_t)(~SAMP_CAP_IO_MASK_B);
  GPIOB->MODER = (uint32_t)((GPIOB->MODER & ~(SAMP_CAP_MODER_MASK_B)) | SAMP_CAP_MODER_MASK_B_OUT);
#endif
#ifdef PORT_C
  GPIOC->ODR &= (uint16_t)(~SAMP_CAP_IO_MASK_C);
  GPIOC->MODER = (uint32_t)((GPIOC->MODER & ~(SAMP_CAP_MODER_MASK_C)) | SAMP_CAP_MODER_MASK_C_OUT);
#endif

  /* Discharging Ctouch */
#ifdef PORT_A
  GPIOA->ODR &= (uint16_t)(~P1_IO_MASK_A);
  GPIOA->MODER = (uint32_t)((GPIOA->MODER & ~(P1_MODER_MASK_A)) | P1_MODER_MASK_A_OUT);
#endif
#ifdef PORT_B
  GPIOB->ODR &= (uint16_t)(~P1_IO_MASK_B);
  GPIOB->MODER = (uint32_t)((GPIOB->MODER & ~(P1_MODER_MASK_B)) | P1_MODER_MASK_B_OUT);
#endif
#ifdef PORT_C
  GPIOC->ODR &= (uint16_t)(~P1_IO_MASK_C);
  GPIOC->MODER = (uint32_t)((GPIOC->MODER & ~(P1_MODER_MASK_C)) | P1_MODER_MASK_C_OUT);
#endif

  /* Discharging Ctouch */
#if (NUMBER_OF_SINGLE_CHANNEL_PORTS > 1)
#ifdef PORT_A
  GPIOA->ODR &= (uint16_t)(~P2_IO_MASK_A);
  GPIOA->MODER = (uint32_t)((GPIOA->MODER & ~(P2_MODER_MASK_A)) | P2_MODER_MASK_A_OUT);
#endif
#ifdef PORT_B
  GPIOB->ODR &= (uint16_t)(~P2_IO_MASK_B);
  GPIOB->MODER = (uint32_t)((GPIOB->MODER & ~(P2_MODER_MASK_B)) | P2_MODER_MASK_B_OUT);
#endif
#ifdef PORT_C
  GPIOC->ODR &= (uint16_t)(~P2_IO_MASK_C);
  GPIOC->MODER = (uint32_t)((GPIOC->MODER & ~(P2_MODER_MASK_C)) | P2_MODER_MASK_C_OUT);
#endif
#endif

  /* Discharging Ctouch */
#if (NUMBER_OF_SINGLE_CHANNEL_PORTS > 2)
#ifdef PORT_A
  GPIOA->ODR &= (uint16_t)(~P3_IO_MASK_A);
  GPIOA->MODER = (uint32_t)((GPIOA->MODER & ~(P3_MODER_MASK_A)) | P3_MODER_MASK_A_OUT);
#endif
#ifdef PORT_B
  GPIOB->ODR &= (uint16_t)(~P3_IO_MASK_B);
  GPIOB->MODER = (uint32_t)((GPIOB->MODER & ~(P3_MODER_MASK_B)) | P3_MODER_MASK_B_OUT);
#endif
#ifdef PORT_C
  GPIOC->ODR &= (uint16_t)(~P3_IO_MASK_C);
  GPIOC->MODER = (uint32_t)((GPIOC->MODER & ~(P3_MODER_MASK_C)) | P3_MODER_MASK_C_OUT);
#endif
#endif

#if (PROTECT_IO_ACCESS > 0)
  enableInterrupts();
#endif

  /* Wait a while for a good discharging of all capacitors */
  wait(100); // ~25탎 with fHCLK = 32MHz

  /* Open the analog switches */
#ifdef COMP1
  RI->ASCR1 &= (uint32_t)(~(SAMP_CAP_COMP1_MASK | P1_COMP1_MASK));
#endif
#ifdef COMP2
  RI->ASCR2 &= (uint32_t)(~(SAMP_CAP_COMP2_MASK | P1_COMP2_MASK));
#endif

