TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
    /* Sampling capacitor IOs in input floating */

#if (PROTECT_IO_ACCESS > 0)
    disableInterrupts();
#endif

#ifdef PORT_A
    GPIOA->MODER &= (uint32_t)(~SAMP_CAP_MODER_MASK_A);
#endif
#ifdef PORT_B
    GPIOB->MODER &= (uint32_t)(~SAMP_CAP_MODER_MASK_B);
#endif
#ifdef PORT_C
    GPIOC->MODER &= (uint32_t)(~SAMP_CAP_MODER_MASK_C);
#endif

#if (PROTECT_IO_ACCESS > 0)
    enableInterrupts();
#endif

    /* Open the analog switches to allow checking of the inputs */
#ifdef COMP1
    RI->ASCR1 &= (uint32_t)(~(SAMP_CAP_COMP1_MASK | P1_COMP1_MASK));
#endif
#ifdef COMP2
    RI->ASCR2 &= (uint16_t)(~(SAMP_CAP_COMP2_MASK | P1_COMP2_MASK));
#endif

    /*it's better to implement this like that because it's much more faster than to put this test in the "while test" below */
    if (MeasurementCounter > SCKEY_MAX_ACQUISITION)
    {
      __NOP();
      break;
    }

#if SPREAD_SPECTRUM && SW_SPREAD_SPECTRUM
    TSL_SW_Spread_Spectrum();
#endif

  }
  while (((Channel_P1.State.whole & Channel_P1.EnabledChannels) != Channel_P1.EnabledChannels));

#if SPREAD_SPECTRUM && !SW_SPREAD_SPECTRUM
  /* Restore the user application calibration value */
  RCC->ICSCR  = HSI_fact_Calib;
#endif

}


#if NUMBER_OF_ACQUISITION_PORTS > 1

/**
  ******************************************************************************
  * @brief Acquisition function for the 2nd Channel IO of each group
  * @param None
  * @retval None
  ******************************************************************************
  */
void TSL_IO_Acquisition_P2(void)
{
  uint32_t MeasurementCounter;

#if SPREAD_SPECTRUM && !SW_SPREAD_SPECTRUM
  uint32_t HSI_fact_Calib;
#endif

  /* Reset the counter values */
  MeasurementCounter = 0;
  Channel_P2.Measure[0] = 0;
  Channel_P2.Measure[1] = 0;
  Channel_P2.Measure[2] = 0;
  Channel_P2.Measure[3] = 0;
  Channel_P2.Measure[4] = 0;
  Channel_P2.Measure[5] = 0;
  Channel_P2.Measure[6] = 0;
  Channel_P2.Measure[7] = 0;
  Channel_P2.Measure[8] = 0;
  Channel_P2.Measure[9] = 0;
  Channel_P2.State.whole = 0;

  /* Open the analog switches */
#ifdef COMP1
  RI->ASCR1 &= (uint32_t)(~(SAMP_CAP_COMP1_MASK | P2_COMP1_MASK));
#endif
#ifdef COMP2
  RI->ASCR2 &= (uint16_t)(~(SAMP_CAP_COMP2_MASK | P2_COMP2_MASK));
#endif

  /* All IO to pushpull LOW for discharging all capacitors (Ctouch and Csense) */

  /* Discharging sampling capacitor */

#if (PROTECT_IO_ACCESS > 0)
  disableInterrupts();
#endif

#ifdef PORT_A
  GPIOA->ODR &= (uint16_t)(~SAMP_CAP_IO_MASK_A);
  GPIOA->MODER = (uint32_t)((GPIOA->MODER & ~(SAMP_CAP_MODER_MASK_A)) | SAMP_CAP_MODER_MASK_A_OUT);
#endif
#ifdef PORT_B
  GPIOB->ODR &= (uint16_t)(~SAMP_CAP_IO_MASK_B);
  GPIOB->MODER = (uint32_t)((GPIOB->MODER & ~(SAMP_CAP_MODER_MASK_B)) | SAMP_CAP_MODER_MASK_B_OUT);
#endif
#ifdef PORT_C
  GPIOC->ODR &= (uint16_t)(~ SAMP_CAP_IO_MASK_C);
  GPIOC->MODER = (uint32_t)((GPIOC->MODER & ~(SAMP_CAP_MODER_MASK_C)) | SAMP_CAP_MODER_MASK_C_OUT);
#endif

  /* Discharging Ctouch */
#ifdef PORT_A
  GPIOA->ODR &= (uint16_t)(~P2_IO_MASK_A);
  GPIOA->MODER = (uint32_t)((GPIOA->MODER & ~(P2_MODER_MASK_A)) | P2_MODER_MASK_A_OUT);
#endif
#ifdef PORT_B
  GPIOB->ODR &= (uint16_t)(~P2_IO_MASK_B);
  GPIOB->MODER = (uint32_t)((GPIOB->MODER & ~(P2_MODER_MASK_B)) | P2_MODER_MASK_B_OUT);
#endif
#ifdef PORT_C
  GPIOC->ODR &= (uint16_t)(~P2_IO_MASK_C);
  GPIOC->MODER = (uint32_t)((GPIOC->MODER & ~(P2_MODER_MASK_C)) | P2_MODER_MASK_C_OUT);
#endif

#if (PROTECT_IO_ACCESS > 0)
  enableInterrupts();
#endif

  /* Wait a while for a good discharging of all capacitors */
  wait(50); // ~14탎 with fHCLK = 32MHz

  /* All IO in input floating */

#if (PROTECT_IO_ACCESS > 0)
  disableInterrupts();
#endif

#ifdef PORT_A
  GPIOA->MODER &= (uint32_t)(~P2_MODER_MASK_A);
#endif
#ifdef PORT_B
  GPIOB->MODER &= (uint32_t)(~P2_MODER_MASK_B);
#endif
#ifdef PORT_C
  GPIOC->MODER &= (uint32_t)(~P2_MODER_MASK_C);
#endif

#if (PROTECT_IO_ACCESS > 0)
  enableInterrupts();
#endif

  /* Start HW spread spectrum */
#if SPREAD_SPECTRUM && !SW_SPREAD_SPECTRUM
  /* Save the user application calibration value */
  HSI_fact_Calib = RCC->ICSCR;
  /* Reset trimmer */
  RCC->ICSCR &= (uint32_t)(~(uint32_t)(0x1F << 8));
  /* Reset Previous_calibration_value */
  Previous_calibration_value = HW_SPREAD_FREQ_MIN;
  /* Init Trimmer */
  RCC->ICSCR |= (uint32_t)(Previous_calibration_value << 8);
#endif

  /* Sampling capacitor IOs in input floating */

#if (PROTECT_IO_ACCESS > 0)
  disableInterrupts();
#endif

#ifdef PORT_A
  GPIOA->MODER &= (uint32_t)(~SAMP_CAP_MODER_MASK_A);
#endif
#ifdef PORT_B
  GPIOB->MODER &= (uint32_t)(~SAMP_CAP_MODER_MASK_B);
#endif
#ifdef PORT_C
  GPIOC->MODER &= (uint32_t)(~SAMP_CAP_MODER_MASK_C);
#endif

#if (PROTECT_IO_ACCESS > 0)
  enableInterrupts();
#endif

  /* Loop while all the 1st channel of each group have not reach the VIH level */
  do
  {

    /* Close the sampling capacitor analog switch */
#ifdef COMP1
    RI->ASCR1 |= (uint32_t)(SAMP_CAP_COMP1_MASK);
#endif
#ifdef COMP2
    RI->ASCR2 |= (uint32_t)(SAMP_CAP_COMP2_MASK);
#endif

    /* Charging Ctouch with connecting the IO to Vdd (io in push-pull HIGH) */

#if (PROTECT_IO_ACCESS > 0)
    disableInterrupts();
#endif

#ifdef PORT_A
    GPIOA->ODR |= (uint16_t)(P2_IO_MASK_A);  /* HIGH level */
    GPIOA->MODER = (uint32_t)((GPIOA->MODER & ~(P2_MODER_MASK_A)) | P2_MODER_MASK_A_OUT);/* Output push pull config */
#endif
#ifdef PORT_B
    GPIOB->ODR |= (uint16_t)(P2_IO_MASK_B); /* HIGH level */
    GPIOB->MODER = (uint32_t)((GPIOB->MODER & ~(P2_MODER_MASK_B)) | P2_MODER_MASK_B_OUT);/* Output push pull config */
#endif
#ifdef PORT_C
    GPIOC->ODR |= (uint16_t)(P2_IO_MASK_C); /* HIGH level */
    GPIOC->MODER = (uint32_t)((GPIOC->MODER & ~(P2_MODER_MASK_C)) | P2_MODER_MASK_C_OUT);/* Output push pull config */
#endif

#if (PROTECT_IO_ACCESS > 0)
    enableInterrupts();
#endif

