TangibleDisplay/twiz-fw/lib/motion_driver_6.1/arm/STM32L_MD6/Libraries/STM32_TouchSensing_Driver/src/stm32l15x_tsl_ct_acquisition.c
    /* Wait a while for a good charging (programmable delay) */
    __TSL_wait_CLWHTA();

#ifdef PORT_A
    if ((Channel_P2.State.b.Grp1 == 0) && ((GPIOA->IDR & SAMP_CAP_IO_MASK_1) == SAMP_CAP_IO_MASK_1))
    {
      Channel_P2.Measure[0] = MeasurementCounter;
      Channel_P2.State.b.Grp1 = 1;
    }
#endif

#ifdef PORT_B
    if ((Channel_P2.State.b.Grp7 == 0) && ((GPIOB->IDR & SAMP_CAP_IO_MASK_7) == SAMP_CAP_IO_MASK_7))
    {
      Channel_P2.Measure[6] = MeasurementCounter;
      Channel_P2.State.b.Grp7 = 1;
    }
#endif

#ifdef PORT_C
    if ((Channel_P2.State.b.Grp8 == 0) && ((GPIOC->IDR & SAMP_CAP_IO_MASK_8) == SAMP_CAP_IO_MASK_8))
    {
      Channel_P2.Measure[7] = MeasurementCounter;
      Channel_P2.State.b.Grp8 = 1;
    }

    if ((Channel_P2.State.b.Grp10 == 0) && ((GPIOC->IDR & SAMP_CAP_IO_MASK_10) == SAMP_CAP_IO_MASK_10))
    {
      Channel_P2.Measure[9] = MeasurementCounter;
      Channel_P2.State.b.Grp10 = 1;
    }
#endif

#if (SAMP_CAP_CH != CH4) && (SAMP_CAP_CH != CH3)

#ifdef PORT_A
    if ((Channel_P2.State.b.Grp4 == 0) && ((GPIOA->IDR & SAMP_CAP_IO_MASK_4) == SAMP_CAP_IO_MASK_4))
    {
      Channel_P2.Measure[3] = MeasurementCounter;
      Channel_P2.State.b.Grp4 = 1;
    }

    if ((Channel_P2.State.b.Grp5 == 0) && ((GPIOA->IDR & SAMP_CAP_IO_MASK_5) == SAMP_CAP_IO_MASK_5))
    {
      Channel_P2.Measure[4] = MeasurementCounter;
      Channel_P2.State.b.Grp5 = 1;
    }
#endif

#ifdef PORT_A
    if ((Channel_P2.State.b.Grp2 == 0) && ((GPIOA->IDR & SAMP_CAP_IO_MASK_2) == SAMP_CAP_IO_MASK_2))
    {
      Channel_P2.Measure[1] = MeasurementCounter;
      Channel_P2.State.b.Grp2 = 1;
    }
#endif

#ifdef PORT_B
    if ((Channel_P2.State.b.Grp3 == 0) && ((GPIOB->IDR & SAMP_CAP_IO_MASK_3) == SAMP_CAP_IO_MASK_3))
    {
      Channel_P2.Measure[2] = MeasurementCounter;
      Channel_P2.State.b.Grp3 = 1;
    }

    if ((Channel_P2.State.b.Grp6 == 0) && ((GPIOB->IDR & SAMP_CAP_IO_MASK_6) == SAMP_CAP_IO_MASK_6))
    {
      Channel_P2.Measure[5] = MeasurementCounter;
      Channel_P2.State.b.Grp6 = 1;
    }
#endif

#ifdef PORT_C
    if ((Channel_P2.State.b.Grp9 == 0) && ((GPIOC->IDR & SAMP_CAP_IO_MASK_9) == SAMP_CAP_IO_MASK_9))
    {
      Channel_P2.Measure[8] = MeasurementCounter;
      Channel_P2.State.b.Grp9 = 1;
    }
#endif

#elif (SAMP_CAP_CH != CH4)

#ifdef PORT_A
    if ((Channel_P2.State.b.Grp4 == 0) && ((GPIOA->IDR & SAMP_CAP_IO_MASK_4) == SAMP_CAP_IO_MASK_4))
    {
      Channel_P2.Measure[3] = MeasurementCounter;
      Channel_P2.State.b.Grp4 = 1;
    }

    if ((Channel_P2.State.b.Grp5 == 0) && ((GPIOA->IDR & SAMP_CAP_IO_MASK_5) == SAMP_CAP_IO_MASK_5))
    {
      Channel_P2.Measure[4] = MeasurementCounter;
      Channel_P2.State.b.Grp5 = 1;
    }
#endif

#endif

    /* Configure All IOs in input floating */

#if (PROTECT_IO_ACCESS > 0)
    disableInterrupts();
#endif

#ifdef PORT_A
    GPIOA->MODER &= (uint32_t)(~P2_MODER_MASK_A);
#endif
#ifdef PORT_B
    GPIOB->MODER &= (uint32_t)(~P2_MODER_MASK_B);
#endif
#ifdef PORT_C
    GPIOC->MODER &= (uint32_t)(~P2_MODER_MASK_C);
#endif

#if (PROTECT_IO_ACCESS > 0)
    enableInterrupts();
#endif

    MeasurementCounter++;

    /* Charging the Csense cap with connecting it to Ctouch by closing the analog switch */
#ifdef COMP1
    RI->ASCR1 |= (uint32_t)(P2_COMP1_MASK);
#endif
#ifdef COMP2
    RI->ASCR2 |= (uint16_t)(P2_COMP2_MASK);
#endif

    /* Wait a while for a good charge transfering (programmable delay) */
    __TSL_wait_CLWLTA();

#if SPREAD_SPECTRUM && !SW_SPREAD_SPECTRUM
    if (Previous_calibration_value >= (uint8_t)(HW_SPREAD_FREQ_MAX))
    {
      Previous_calibration_value = HW_SPREAD_FREQ_MIN;
      RCC->ICSCR &= (uint32_t)(~0x00001F00);
      RCC->ICSCR |= (uint32_t)(Previous_calibration_value << 8);
    }
    else
    {
      RCC->ICSCR += 0x100;
      Previous_calibration_value++;
    }
#endif

    /* Sampling capacitor IOs in input floating */

#if (PROTECT_IO_ACCESS > 0)
    disableInterrupts();
#endif

#ifdef PORT_A
    GPIOA->MODER &= (uint32_t)(~SAMP_CAP_MODER_MASK_A);
#endif
#ifdef PORT_B
    GPIOB->MODER &= (uint32_t)(~SAMP_CAP_MODER_MASK_B);
#endif
#ifdef PORT_C
    GPIOC->MODER &= (uint32_t)(~SAMP_CAP_MODER_MASK_C);
#endif

#if (PROTECT_IO_ACCESS > 0)
    enableInterrupts();
#endif

    /* Open the analog switches to allow checking of the inputs */
#ifdef COMP1
    RI->ASCR1 &= (uint32_t)(~(SAMP_CAP_COMP1_MASK | P2_COMP1_MASK));
#endif
#ifdef COMP2
    RI->ASCR2 &= (uint16_t)(~(SAMP_CAP_COMP2_MASK | P2_COMP2_MASK));
#endif


    /* it's better to implement this like that because it's much more faster than to put this test in the "while test" below */
    if (MeasurementCounter > SCKEY_MAX_ACQUISITION)
    {
      __NOP();
      break;
    }
#if SPREAD_SPECTRUM && SW_SPREAD_SPECTRUM
    TSL_SW_Spread_Spectrum();
#endif

  }
  while (((Channel_P2.State.whole & Channel_P2.EnabledChannels) != Channel_P2.EnabledChannels));

#if SPREAD_SPECTRUM && !SW_SPREAD_SPECTRUM
  /* Restore the user application calibration value */
  RCC->ICSCR  = HSI_fact_Calib;
#endif
}
#endif
//# NUMBER_OF_ACQUISITION_PORTS > 1

#if NUMBER_OF_ACQUISITION_PORTS > 2

/**
  ******************************************************************************
  * @brief Acquisition function for the 3rd Channel IO of each group
  * @param None
  * @retval None
  ******************************************************************************
  */
void TSL_IO_Acquisition_P3(void)
{
  uint32_t MeasurementCounter;

#if SPREAD_SPECTRUM && !SW_SPREAD_SPECTRUM
  uint32_t HSI_fact_Calib;
#endif

  /* Reset the counter values */
  MeasurementCounter = 0;
  Channel_P3.Measure[0] = 0;
  Channel_P3.Measure[1] = 0;
  Channel_P3.Measure[2] = 0;
  Channel_P3.Measure[3] = 0;
  Channel_P3.Measure[4] = 0;
  Channel_P3.Measure[5] = 0;
  Channel_P3.Measure[6] = 0;
  Channel_P3.Measure[7] = 0;
  Channel_P3.Measure[8] = 0;
  Channel_P3.Measure[9] = 0;
  Channel_P3.State.whole = 0;

  /* Open the analog switches */
#ifdef COMP1
  RI->ASCR1 &= (uint32_t)(~(SAMP_CAP_COMP1_MASK | P3_COMP1_MASK));
#endif
#ifdef COMP2
  RI->ASCR2 &= (uint16_t)(~(SAMP_CAP_COMP2_MASK | P3_COMP2_MASK));
#endif

  /* All IO to pushpull LOW for discharging all capacitors (Ctouch and Csense) */

  /* Discharging sampling capacitor */

#if (PROTECT_IO_ACCESS > 0)
  disableInterrupts();
#endif

#ifdef PORT_A
  GPIOA->ODR &= (uint16_t)(~SAMP_CAP_IO_MASK_A);
  GPIOA->MODER = (uint32_t)((GPIOA->MODER & ~(SAMP_CAP_MODER_MASK_A)) | SAMP_CAP_MODER_MASK_A_OUT);
#endif
#ifdef PORT_B
  GPIOB->ODR &= (uint16_t)(~SAMP_CAP_IO_MASK_B);
  GPIOB->MODER = (uint32_t)((GPIOB->MODER & ~(SAMP_CAP_MODER_MASK_B)) | SAMP_CAP_MODER_MASK_B_OUT);
#endif
#ifdef PORT_C
  GPIOC->ODR &= (uint16_t)(~ SAMP_CAP_IO_MASK_C);
  GPIOC->MODER = (uint32_t)((GPIOC->MODER & ~(SAMP_CAP_MODER_MASK_C)) | SAMP_CAP_MODER_MASK_C_OUT);
#endif

  /* Discharging Ctouch */
#ifdef PORT_A
  GPIOA->ODR &= (uint16_t)(~P3_IO_MASK_A);
  GPIOA->MODER = (uint32_t)((GPIOA->MODER & ~(P3_MODER_MASK_A)) | P3_MODER_MASK_A_OUT);
#endif
#ifdef PORT_B
  GPIOB->ODR &= (uint16_t)(~P3_IO_MASK_B);
  GPIOB->MODER = (uint32_t)((GPIOB->MODER & ~(P3_MODER_MASK_B)) | P3_MODER_MASK_B_OUT);
#endif
#ifdef PORT_C
  GPIOC->ODR &= (uint16_t)(~P3_IO_MASK_C);
  GPIOC->MODER = (uint32_t)((GPIOC->MODER & ~(P3_MODER_MASK_C)) | P3_MODER_MASK_C_OUT);
#endif

#if (PROTECT_IO_ACCESS > 0)
  enableInterrupts();
#endif

  /* Wait a while for a good discharging of all capacitors */
  wait(50); // ~14탎 with fHCLK = 32MHz

  /* All IO in input floating */

#if (PROTECT_IO_ACCESS > 0)
  disableInterrupts();
#endif

#ifdef PORT_A
  GPIOA->MODER &= (uint32_t)(~P3_MODER_MASK_A);
#endif
#ifdef PORT_B
  GPIOB->MODER &= (uint32_t)(~P3_MODER_MASK_B);
#endif
#ifdef PORT_C
  GPIOC->MODER &= (uint32_t)(~P3_MODER_MASK_C);
#endif

#if (PROTECT_IO_ACCESS > 0)
  enableInterrupts();
#endif

